{
  "slug": "a-plus-roto-rooter",
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJ2Z-O8oI9YIgRAkwCAxfAc9Y",
      "name": "Donna Guy",
      "text": "I had water all over the floors from my sewer which was backed up.  Corey came to the rescue.  Within 15 minutes of arrival, all was cleaned out and water flowing again.  He gave me some good advice also.  He is so professional, but yet easy to talk to.  Thank  you.  I will definitely call you again.",
      "textTranslated": null,
      "publishAt": "4 years ago",
      "publishedAtDate": "2020-09-30T14:39:45.461Z",
      "likesCount": 0,
      "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURDa2RpYlV3EAE",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURDa2RpYlV3EAE!2m1!1s0x0:0xd673c01703024c02!3m1!1s2@1:CIHM0ogKEICAgIDCkdibUw%7CCgwIsbHS-wUQiPrr2wE%7C?hl=en",
      "reviewerId": "115009396155786564469",
      "reviewerUrl": "https://www.google.com/maps/contrib/115009396155786564469?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocKbOCXpIKQA5oTFUwxiiNds-QIKQX6r8QPYjUedyJ88mnVZ0Q=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 15,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ2Z-O8oI9YIgRAkwCAxfAc9Y",
      "location": {
        "lat": 34.718502,
        "lng": -85.115561
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "A Plus Roto Rooter",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=A%20Plus%20Roto%20Rooter&query_place_id=ChIJ2Z-O8oI9YIgRAkwCAxfAc9Y",
      "price": null,
      "cid": "15452905951505566722",
      "fid": "0x88603d82f28e9fd9:0xd673c01703024c02"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [
    "sewer cleaning"
  ],
  "firstReviewDate": "2020-09-30",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for the specific Alabama plumbing business \"A Plus Roto Rooter\":\n\n## Business Information\n- **Alabama Business Registration/License Details**: There is no specific information available from the sources provided regarding the business registration or license details of \"A Plus Roto Rooter\" in Alabama. You would need to check with the State of Alabama's business registration database or the Alabama Plumbers & Gas Fitters Examining Board for this information.\n- **Physical Location and Service Areas**: The Google Place ID and phone number suggest a specific location, but the exact physical address is not provided in the sources. You can use the Google Place ID (ChIJ2Z-O8oI9YIgRAkwCAxfAc9Y) to find the location on Google Maps.\n- **Hours and Payment Methods**: There is no detailed information available on the hours of operation or payment methods for \"A Plus Roto Rooter\".\n- **Years in Operation**: No information is available on how long \"A Plus Roto Rooter\" has been in operation.\n\n## Services & Specialties\n- **Types of Services Offered**: Since the specific sources do not mention \"A Plus Roto Rooter,\" we cannot verify the exact services offered. However, based on the general services provided by Roto-Rooter franchises, it is likely they offer services such as drain cleaning, sewer line repair, septic tank services, and other plumbing-related services[2][4].\n- **Service Areas Covered**: The service areas are not specified for \"A Plus Roto Rooter,\" but it is likely to serve areas around its physical location.\n- **Emergency Service Availability**: Given the nature of Roto-Rooter services, it is probable that \"A Plus Roto Rooter\" offers 24/7 emergency services, but this cannot be confirmed from the provided sources.\n- **Prices or Rates**: There is no information available on the prices or rates for \"A Plus Roto Rooter\".\n\n## Customer Reviews & Reputation\n- **Review Summaries with Specific Examples**: With only one review and a rating of 5, there are no detailed summaries or specific examples available.\n- **BBB Rating and Status**: There is no BBB rating or status information available for \"A Plus Roto Rooter\" as it is not listed in the BBB profiles provided[1][5].\n- **Common Customer Feedback Themes**: With only one review, there are no common feedback themes to report.\n- **Response to Reviews**: There is no information on how the business responds to reviews.\n\n## Owner & Staff\n- **Owner/Management Information**: The owner or management information for \"A Plus Roto Rooter\" is not available in the provided sources.\n- **Staff Qualifications**: There is no information on the qualifications or professional certifications of the staff.\n- **Professional Certifications**: No information is available on any professional certifications held by the staff or owner of \"A Plus Roto Rooter\".\n\nGiven the lack of specific information in the sources, it is recommended to visit the business's website, contact them directly, or check with local business registries and licensing boards for more detailed information.",
  "aboutUs": "At A Plus Roto Rooter, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch service to our local community. With our specialized expertise in drain cleaning, sewer line repair, and septic tank services, we offer comprehensive solutions to all your plumbing needs. Our commitment to excellence and customer satisfaction is unmatched, ensuring you receive the highest quality service every time.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a trusted local plumbing company with a proven track record of delivering exceptional service.",
    "sellingPoints": [
      "Rapid response times for emergency plumbing situations, ensuring your issues are resolved promptly and efficiently.",
      "State-of-the-art equipment and techniques, allowing us to tackle even the most complex plumbing challenges with precision and efficiency.",
      "Highly trained and certified technicians who prioritize safety, professionalism, and attention to detail on every job."
    ]
  }
}