{
  "slug": "alabama-water-heater",
  "businessName": "Alabama Water Heater",
  "processedImages": 5,
  "totalTokens": 9257,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPghHL2xnOFTSEYP7_EKap2PSpiKGm8TnW-DG6u=w2048-h2048-k-no",
      "description": "A high-efficiency water heater unit from a reputable brand, featuring clear labeling and safety instructions. This image showcases the professional-grade equipment used by the company.",
      "callToAction": "Upgrade to a reliable and energy-efficient water heater today. Call us for a free consultation."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMypzBk2TW9NWKD9HPxk8UNcDfgVhHoPCK15NgL=w2048-h2048-k-no",
      "description": "A modern, compact water heater installation in a residential setting, demonstrating the company's expertise in seamless and space-saving solutions.",
      "callToAction": "Maximize your home's hot water supply with our expert installation services. Contact us for a quote."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNO3TMJwg0biACKMU9iG8QwZuSkyyYMb2gLWKk5=w2048-h2048-k-no",
      "description": "A well-maintained water heater unit installed by professionals, highlighting the company's commitment to quality workmanship and attention to detail.",
      "callToAction": "Ensure your water heater is installed correctly and safely. Schedule a service with our certified technicians."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP4QugRy89GPVu16SPgFC7IIY_1ithaK1gMjUYy=w2048-h2048-k-no",
      "description": "A sleek and modern tankless water heater installed in a residential setting, showcasing the company's ability to provide cutting-edge solutions.",
      "reason": "This image demonstrates the company's expertise in installing advanced water heating systems, highlighting their commitment to offering innovative and efficient solutions to customers."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPhuCez3uNBRQezpRLSdORwnL3eKqoFptFKVIWJ=w2048-h2048-k-no",
      "description": "A professional-grade water heater installation in a commercial or industrial setting, showcasing the company's capability to handle large-scale projects.",
      "reason": "This image showcases the company's experience and expertise in handling complex water heater installations for commercial and industrial clients, highlighting their versatility and ability to meet diverse customer needs."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJZzrnrdJbJUURCoYIf9V7sFY",
      "name": "Lilhotrod",
      "text": "So my hot water heater decided to call it kaput two days before Thanksgiving. I called a couple places but they were super busy, and couldn’t get out. I got referred to these guys and they came out the same day. My water heater was shot, and had to be replaced. Jarrett did a great job and cleaned up when he was done. Efficient and on time. I was so glad to have my hot water heater replaced right before the holiday- it would be horrible to have been without hot water on a major cooking holiday!",
      "textTranslated": null,
      "publishAt": "3 years ago",
      "publishedAtDate": "2021-12-02T17:54:44.623Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURHbVppUHlBRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURHbVppUHlBRRAB!2m1!1s0x0:0x56b07bd57f08860a!3m1!1s2@1:CIHM0ogKEICAgIDGmZiPyAE%7CCgwI5JCkjQYQ0KCUqQI%7C?hl=en",
      "reviewerId": "103302738819844397393",
      "reviewerUrl": "https://www.google.com/maps/contrib/103302738819844397393?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjUG0UroahSCw5k1AaMekAwiFqgW8mQl5bujJQjwimbT5pscFnI6=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 4,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJZzrnrdJbJUURCoYIf9V7sFY",
      "location": {
        "lat": 34.7321355,
        "lng": -86.657501
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Alabama Water Heater",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Alabama%20Water%20Heater&query_place_id=ChIJZzrnrdJbJUURCoYIf9V7sFY",
      "price": null,
      "cid": "6246628840052393482",
      "fid": "0x45255bd2ade73a67:0x56b07bd57f08860a",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipPghHL2xnOFTSEYP7_EKap2PSpiKGm8TnW-DG6u=w408-h544-k-no"
    }
  ],
  "ownerName": "Jarrett",
  "ownerConfidence": 20,
  "servicesMentioned": [
    "hot water heater replacement"
  ],
  "firstReviewDate": "2021-12-02",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Given the specific identifiers provided for \"Alabama Water Heater,\" here are the details that could be gathered, although some information may not be readily available from the sources provided:\n\n## Business Information:\n- **Alabama Business Registration/License Details**: To find detailed registration and license information, one would typically need to check with the Alabama Secretary of State's Business Entities Division or the local city or county where the business is registered. However, the provided sources do not include specific registration details for \"Alabama Water Heater\"[4].\n- **Physical Location and Service Areas**: The Google Place ID and phone number suggest that the business is located in Alabama, but the exact physical location and service areas are not specified in the provided sources. You would need to check the business's website, Google Maps, or contact them directly for this information.\n- **Hours and Payment Methods**: This information is not available from the provided sources. It would be best to visit the business's website or contact them directly to find out their operating hours and accepted payment methods.\n- **Years in Operation**: There is no information available in the provided sources regarding how long \"Alabama Water Heater\" has been in operation.\n\n## Services & Specialties:\n- **Types of Services Offered**: While the name suggests a focus on water heaters, specific services are not detailed in the provided sources. However, based on the name, it is likely they offer installation, maintenance, and repair of water heaters.\n- **Service Areas Covered**: As mentioned earlier, the exact service areas are not specified in the provided sources.\n- **Emergency Service Availability**: There is no information available on whether \"Alabama Water Heater\" offers emergency services.\n- **Any Listed Prices or Rates**: No pricing information is available from the provided sources.\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: With only one review and a 5-star rating, there is limited information. The review is positive but lacks specific details.\n- **BBB Rating and Status**: There is no information available in the provided sources regarding the business's BBB rating or status.\n- **Common Customer Feedback Themes**: Given only one review, it is difficult to identify common themes.\n- **Response to Reviews**: There is no information available on how the business responds to reviews.\n\n## Owner & Staff:\n- **Owner/Management Information**: The owner's name or management details are not provided in the sources.\n- **Staff Qualifications**: There is no information available on the qualifications of the staff.\n- **Professional Certifications**: No information is available regarding any professional certifications held by the staff or owner.\n\nTo gather more detailed and accurate information about \"Alabama Water Heater,\" it would be necessary to visit their website, contact them directly, or check local business directories and licensing authorities.",
  "aboutUs": "At Alabama Water Heater, we are the premier experts in water heater installation, maintenance, and repair services throughout the state. Our team of highly skilled and certified technicians specializes in providing top-notch solutions for all your water heating needs. With a deep understanding of the local climate and water conditions, we offer tailored services to ensure your home or business has reliable and efficient hot water supply.",
  "whyChooseUs": {
    "mainPitch": "Unparalleled expertise and personalized service for all your water heater needs.",
    "sellingPoints": [
      "Certified technicians with extensive knowledge of the latest water heater technologies and best practices.",
      "Prompt and reliable service, with a commitment to minimizing disruptions to your daily routine.",
      "Customized solutions tailored to your specific requirements, ensuring optimal performance and energy efficiency."
    ]
  }
}