{
  "slug": "allens-allpro-services-llc",
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Allens AllPro Services LLC\" (ID: ChIJKzv9Mw5X9IgR3qzjyIYeuSo) has no reviews",
      "searchString": "place_id:ChIJKzv9Mw5X9IgR3qzjyIYeuSo",
      "isAdvertisement": false,
      "placeId": "ChIJKzv9Mw5X9IgR3qzjyIYeuSo",
      "location": {
        "lat": 32.67853,
        "lng": -83.1940624
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Computer service",
        "Service establishment",
        "Fence contractor",
        "Remodeler"
      ],
      "title": "Allens AllPro Services LLC",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Allens%20AllPro%20Services%20LLC&query_place_id=ChIJKzv9Mw5X9IgR3qzjyIYeuSo",
      "price": null,
      "cid": "3078525384529259742",
      "fid": "0x88f4570e33fd3b2b:0x2ab91e86c8e3acde",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOAcnBrmSB-rTTTTr2gdVcnf7jPSLqpVOTC14eu=w428-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for **Allens AllPro Services LLC** in Alabama:\n\n## Business Information\n- **Alabama Business Registration:** To obtain detailed registration information, you would need to check the Alabama Secretary of State's Business Entities database. However, the provided sources do not include specific registration details for Allens AllPro Services LLC. You can visit the Alabama Secretary of State's website to search for the business entity[4].\n- **Physical Location and Service Areas:** The specific physical location and service areas of Allens AllPro Services LLC are not provided in the sources. You may need to check the business's official website, Google Maps, or contact them directly for this information.\n- **Hours and Payment Methods:** There is no available information on the hours of operation or payment methods for Allens AllPro Services LLC from the provided sources.\n- **Years in Operation:** The sources do not specify how long Allens AllPro Services LLC has been in operation.\n\n## Services & Specialties\n- **Types of Services Offered:** Since the sources do not provide specific details about Allens AllPro Services LLC, you would need to visit their official website or contact them directly to determine the types of services they offer.\n- **Service Areas Covered:** As mentioned earlier, the service areas are not specified in the provided sources.\n- **Emergency Service Availability:** There is no information available on whether Allens AllPro Services LLC offers emergency services.\n- **Prices or Rates:** No pricing information is available from the provided sources.\n\n## Customer Reviews & Reputation\n- **Review Summaries:** There are no review summaries or specific examples available for Allens AllPro Services LLC in the provided sources.\n- **BBB Rating and Status:** The sources do not include any information about the BBB rating or status of Allens AllPro Services LLC. You would need to check the Better Business Bureau website directly.\n- **Common Customer Feedback Themes:** Without access to reviews or feedback, it is not possible to identify common customer feedback themes.\n- **Response to Reviews:** There is no information available on how the business responds to reviews.\n\n## Owner & Staff\n- **Owner/Management Information:** The owner's name or management details for Allens AllPro Services LLC are not provided in the sources.\n- **Staff Qualifications:** There is no information available on the qualifications or certifications of the staff.\n- **Professional Certifications:** No details on professional certifications are available from the provided sources.\n\nGiven the lack of specific information in the sources, it is recommended to visit the Alabama Secretary of State's website, the business's official website, or contact them directly to obtain the detailed information you are seeking.",
  "aboutUs": "At Allens AllPro Services LLC, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch service to our local community. Our expertise spans a wide range of plumbing services, from routine maintenance and repairs to complex installations and renovations. With a deep understanding of the latest industry techniques and technologies, we strive to deliver efficient and reliable solutions tailored to your unique needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a trusted local plumbing company committed to excellence.",
    "sellingPoints": [
      "Rapid response times for all plumbing emergencies, ensuring your issues are addressed promptly.",
      "Highly trained and certified technicians equipped with the latest tools and techniques to tackle any plumbing challenge.",
      "Transparent pricing and upfront cost estimates, so you know exactly what to expect before any work begins."
    ]
  }
}