{
  "slug": "alpha-plumbers-inc",
  "businessName": "Alpha Plumbers Inc",
  "processedImages": 8,
  "totalTokens": 17827,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPcDwKtKxQUNeyQ7WyL1p7T9gBHKt8M2p5rCJ6c=w2048-h2048-k-no",
      "description": "This image showcases the expertise of Alpha Plumbers Inc. in underground plumbing work. It depicts a trench being dug for pipe installation or repair, with tools and materials neatly organized nearby.",
      "callToAction": "Trust our experienced team for all your underground plumbing needs. Call us today for a free estimate!"
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOd3UUwthzW9PslfI99g6GncH3NKtn5GTZjWsaV=w2048-h2048-k-no",
      "description": "This image highlights the professionalism and attention to detail of Alpha Plumbers Inc. It shows a well-maintained water heater installation, with neatly organized pipes and connections.",
      "callToAction": "Upgrade to a new, energy-efficient water heater with our expert installation services. Contact us now for a quote!"
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPhoxHoMA36DYWMRa0BfcVnl2rAvS6fiG8LbcPO=w2048-h2048-k-no",
      "description": "This powerful image represents the core services of Alpha Plumbers Inc. The crossed plumbing wrenches symbolize the company's expertise and readiness to tackle any plumbing challenge.",
      "callToAction": "For reliable and affordable plumbing solutions, choose the RIGHT plumber at the RIGHT price. Call Alpha Plumbers Inc. today!"
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOfNvno--Dv8ICyXOLb1ejslDoEOZm0jZdXB5bk=w2048-h2048-k-no",
      "description": "This image showcases the attention to detail and quality workmanship of Alpha Plumbers Inc. It depicts a neatly organized plumbing system with clean pipe connections and proper insulation.",
      "reason": "This image works well for the About Us section as it demonstrates the company's commitment to excellence and professionalism in their work."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMg8IxkeELBKolX-9pERX7PY5U1CD4IW4HeCmYZ=w2048-h2048-k-no",
      "description": "This image highlights the versatility and range of services offered by Alpha Plumbers Inc. It shows a well-maintained outdoor area with various plumbing fixtures and landscaping elements.",
      "reason": "This image is suitable for the About Us section as it showcases the company's ability to handle both indoor and outdoor plumbing projects, as well as their attention to detail in maintaining a clean and organized work environment."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Alpha Plumbers Inc\" (ID: ChIJNVITTC0dm4gRk-K2KS9nBo4) has no reviews",
      "searchString": "place_id:ChIJNVITTC0dm4gRk-K2KS9nBo4",
      "isAdvertisement": false,
      "placeId": "ChIJNVITTC0dm4gRk-K2KS9nBo4",
      "location": {
        "lat": 30.6871274,
        "lng": -87.9746256
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Alpha Plumbers Inc",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Alpha%20Plumbers%20Inc&query_place_id=ChIJNVITTC0dm4gRk-K2KS9nBo4",
      "price": null,
      "cid": "10233980655507006099",
      "fid": "0x889b1d2d4c135235:0x8e06672f29b6e293",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipNfGiKy2qpgFu9enFQRZ7GOISs9Ds2bAQcMnUBI=w420-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers, here is the detailed information for Alpha Plumbers Inc in Alabama:\n\n## Business Information:\n- **Alabama Business Registration/License Details**: There is no specific license number mentioned for Alpha Plumbers Inc in the available sources. However, it is noted that the business is in an industry that may require professional licensing, and the State of Alabama Plumbers & Gas Fitters Examining Board is the relevant agency[4].\n- **Physical Location and Service Areas**: Alpha Plumbers Inc is located in Mobile, AL, with the address listed as PO Box 161212, Mobile, AL 36616-2212. There is no detailed information on specific service areas beyond Mobile[4].\n- **Hours and Payment Methods**: There is no information available on the business hours or payment methods for Alpha Plumbers Inc[4].\n- **Years in Operation**: The BBB file for Alpha Plumbers Inc was opened on January 24, 2022. However, it is noted that the business is currently out of business[4].\n\n## Services & Specialties:\n- **Types of Services Offered**: The business categories listed for Alpha Plumbers Inc include general plumbing services, but there is no detailed list of specific services offered[4].\n- **Service Areas Covered**: As mentioned, the service area appears to be limited to Mobile, AL, but no further details are provided.\n- **Emergency Service Availability**: There is no information available on whether Alpha Plumbers Inc offers emergency services.\n- **Prices or Rates**: No pricing or rate information is available for this business[4].\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: There are no review summaries or specific examples available for Alpha Plumbers Inc, as the business is noted to be out of business and has no rating on the BBB[4].\n- **BBB Rating and Status**: Alpha Plumbers Inc is not BBB accredited and has no rating because the business is out of operation[4].\n- **Common Customer Feedback Themes**: Since there are no reviews available, there are no common customer feedback themes to report.\n- **Response to Reviews**: There is no information on how the business responds to reviews, given the lack of reviews and the business being out of operation[4].\n\n## Owner & Staff:\n- **Owner/Management Information**: There is no specific information available on the owner or management of Alpha Plumbers Inc[4].\n- **Staff Qualifications**: No details are provided about the staff qualifications or professional certifications.\n- **Professional Certifications**: There is no information available on any professional certifications held by the staff or owners of Alpha Plumbers Inc[4].",
  "aboutUs": "At Alpha Plumbers Inc, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch service to the Mobile, AL community. Our expertise spans a wide range of plumbing services, from routine maintenance and repairs to complex installations and emergency situations. We take pride in our local presence and commitment to delivering reliable and efficient solutions tailored to your specific needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a trusted and capable plumbing partner.",
    "sellingPoints": [
      "Fully licensed and insured professionals with extensive knowledge of local plumbing codes and regulations.",
      "Rapid response times and 24/7 emergency service availability to address urgent plumbing issues promptly.",
      "Commitment to using the latest techniques and state-of-the-art equipment to ensure efficient and long-lasting solutions."
    ]
  }
}