{
  "slug": "brian-harden-plumbing-inc",
  "businessName": "Brian Harden Plumbing Inc.",
  "processedImages": 5,
  "totalTokens": 8394,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOJUqILlQWWNEU3AvlqEVc5yAw6lL3-7bfyyYvY=w2048-h2048-k-no",
      "description": "A close-up view of a plumber's work boots and jeans, standing next to a modern toilet featuring the Brian Harden Plumbing, Inc. logo, conveying professionalism and attention to detail.",
      "callToAction": "Trust the experts at Brian Harden Plumbing, Inc. for all your residential and commercial plumbing needs. Call us today for reliable, top-quality service."
    },
    {
      "imageIndex": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=cFQUcA86QPiUb7HVR8Rp5Q&cb_client=maps_sv.tactile.gps&w=1600&h=1000&yaw=89.45649&pitch=0&thumbfov=100",
      "description": "An exterior view of a well-maintained residential property with lush greenery, showcasing the company's service area and commitment to serving local communities.",
      "callToAction": "Keep your home's plumbing system in top condition with Brian Harden Plumbing, Inc. Schedule your appointment now for prompt, professional service."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNeVaZmgvI63RLUmdu9yPbf7ReOp8qg0VRi70A6=w2048-h2048-k-no",
      "description": "A close-up of the American flag waving proudly, symbolizing the company's patriotism and dedication to serving the nation.",
      "callToAction": "Experience the American spirit of hard work and excellence with Brian Harden Plumbing, Inc. Contact us for reliable, top-notch plumbing services."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPcqFuwpSqS2yuC6vkV-a9DPOOLn7OH8_by5-wQ=w2048-h2048-k-no",
      "description": "A product image showcasing a high-quality Delta faucet, demonstrating the company's expertise in installing and maintaining top-of-the-line plumbing fixtures.",
      "reason": "This image highlights the company's commitment to using premium products and providing exceptional workmanship, instilling confidence in potential customers."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipObGK3yEKiBSNc0VKRiJm4MZef8S8_RG8AJkL-C=w2048-h2048-k-no",
      "description": "A close-up view of a urinal installation, showcasing the company's capabilities in handling commercial plumbing projects with precision and attention to detail.",
      "reason": "This image demonstrates the company's experience in tackling complex commercial plumbing installations, positioning them as a reliable partner for businesses."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "name": "Tina Little",
      "text": null,
      "textTranslated": null,
      "publishAt": "6 years ago",
      "publishedAtDate": "2019-01-10T03:00:01.746Z",
      "likesCount": 0,
      "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURJOGNfV1N3EAE",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURJOGNfV1N3EAE!2m1!1s0x0:0xbefa719d18f587ce!3m1!1s2@1:CIHM0ogKEICAgIDI8c_WSw%7CCgwIsera4QUQ3aGT5AI%7C?hl=en",
      "reviewerId": "104022739094832167719",
      "reviewerUrl": "https://www.google.com/maps/contrib/104022739094832167719?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjVG-xsEkdEAx3-f21E_Hvk4Fb8lUVs3R16VE6QinxgoWpiWcTCi=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 0,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "location": {
        "lat": 30.5356351,
        "lng": -88.1992606
      },
      "address": "7465 Oak Dr W, Theodore, AL 36582",
      "neighborhood": "Bellmont",
      "street": "7465 Oak Dr W",
      "city": "Theodore",
      "postalCode": "36582",
      "state": "Alabama",
      "countryCode": "US",
      "categoryName": "Plumber",
      "categories": [
        "Plumber"
      ],
      "title": "Brian Harden Plumbing Inc.",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 2,
      "url": "https://www.google.com/maps/search/?api=1&query=Brian%20Harden%20Plumbing%20Inc.&query_place_id=ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "price": null,
      "cid": "13761436530926520270",
      "fid": "0x889bb572563d4ded:0xbefa719d18f587ce",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOJUqILlQWWNEU3AvlqEVc5yAw6lL3-7bfyyYvY=w425-h240-k-no"
    },
    {
      "searchString": "place_id:ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "name": "Dewey Koger",
      "text": "Good",
      "textTranslated": null,
      "publishAt": "6 years ago",
      "publishedAtDate": "2018-02-25T22:13:14.801Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURRN3BTTnRnRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURRN3BTTnRnRRAB!2m1!1s0x0:0xbefa719d18f587ce!3m1!1s2@1:CIHM0ogKEICAgIDQ7pSNtgE%7CCgwI-unM1AUQwJT5_QI%7C?hl=en",
      "reviewerId": "108410979268613516509",
      "reviewerUrl": "https://www.google.com/maps/contrib/108410979268613516509?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjW86o2c3_cNRwtTrHzoWNcf7exHAL9sYlg0GaglqM_LKm35V8suMQ=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 254,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "location": {
        "lat": 30.5356351,
        "lng": -88.1992606
      },
      "address": "7465 Oak Dr W, Theodore, AL 36582",
      "neighborhood": "Bellmont",
      "street": "7465 Oak Dr W",
      "city": "Theodore",
      "postalCode": "36582",
      "state": "Alabama",
      "countryCode": "US",
      "categoryName": "Plumber",
      "categories": [
        "Plumber"
      ],
      "title": "Brian Harden Plumbing Inc.",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 2,
      "url": "https://www.google.com/maps/search/?api=1&query=Brian%20Harden%20Plumbing%20Inc.&query_place_id=ChIJ7U09VnK1m4gRzof1GJ1x-r4",
      "price": null,
      "cid": "13761436530926520270",
      "fid": "0x889bb572563d4ded:0xbefa719d18f587ce",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOJUqILlQWWNEU3AvlqEVc5yAw6lL3-7bfyyYvY=w425-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "2018-02-25",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Here is the detailed information about Brian Harden Plumbing Inc. based on the provided identifiers:\n\n## Business Information\n\n- **Alabama Business Registration/License Details**:\n  - Brian Harden Plumbing Inc. holds a license number MPG-4032 issued by the State of Alabama Plumbers & Gas Fitters Examining Board. The license is set to expire on December 31, 2024[1].\n\n- **Physical Location and Service Areas**:\n  - The business is located at 7465 Oak Dr W, Theodore, AL 36582. They serve a wide area including Mobile, AL, and surrounding communities such as Bay Minette, Bayou La Batre, Chickasaw, Citronelle, Dauphin Island, Grand Bay, Irvington, Prichard, Saraland, and many others in the Mobile and Baldwin counties[1][2].\n\n- **Hours and Payment Methods**:\n  - The specific hours of operation are not listed in the provided sources. However, the business can be contacted at (251) 973-2234 for more information. Payment methods are also not explicitly stated, but it is typical for plumbing services to accept various payment methods including credit cards, checks, and cash.\n\n- **Years in Operation**:\n  - Brian Harden Plumbing Inc. has been in business since January 1, 2000, and was incorporated on June 23, 2005. As of the current date, they have been in operation for 25 years[1].\n\n## Services & Specialties\n\n- **Types of Services Offered**:\n  - The company provides a comprehensive range of residential and commercial plumbing services. These include installation and repair of tankless water heaters, water heaters, faucets, toilets, sinks, tub valves, drain and sewer services, jetting service for drain lines, video camera inspections, sewer and drain line repair/replacement, backflow installation and repair, waterlines, boiler replacement/repair, and medical gas pipe services[1].\n\n- **Service Areas Covered**:\n  - As mentioned earlier, they serve various areas in Mobile and Baldwin counties, including but not limited to Mobile, Bay Minette, Bayou La Batre, and several other local communities[1][2].\n\n- **Emergency Service Availability**:\n  - While the sources do not explicitly mention 24/7 emergency services, it is common for plumbing companies to offer emergency or after-hours services. Customers would need to contact the business directly to confirm their emergency service availability.\n\n- **Prices or Rates**:\n  - The sources do not provide specific prices or rates for the services offered by Brian Harden Plumbing Inc. Customers would need to contact the business for a quote or to inquire about pricing[1].\n\n## Customer Reviews & Reputation\n\n- **Review Summaries with Specific Examples**:\n  - Although the provided sources do not include detailed customer reviews, the business has a BBB Accredited status with an A+ rating. This indicates a high level of customer satisfaction and compliance with BBB standards[1][3].\n\n- **BBB Rating and Status**:\n  - Brian Harden Plumbing Inc. is BBB Accredited since September 10, 2004, and holds an A+ BBB rating. This rating is based on the business's adherence to BBB Accreditation Standards, which include honest advertising, truthful representation of products and services, transparency, honoring promises, and being responsive to customer complaints[1][3].\n\n- **Common Customer Feedback Themes**:\n  - While specific customer reviews are not provided, the A+ BBB rating suggests that customers generally have positive experiences with the business, likely praising their professionalism, service quality, and responsiveness.\n\n- **Response to Reviews**:\n  - The business is required to address disputes forwarded by BBB quickly and in good faith as part of their BBB Accreditation. This includes providing professional responses to complaints, participating in mediation or arbitration if requested, and cooperating with BBB to resolve any underlying issues[3].\n\n## Owner & Staff\n\n- **Owner/Management Information**:\n  - The business is owned and managed by Mr. Brian O. Harden, who serves as the President and Owner. He is also the primary contact for customer inquiries[1].\n\n- **Staff Qualifications**:\n  - The sources do not provide detailed information about the qualifications of the staff beyond the licensing of the business itself. However, given the comprehensive services offered, it is likely that the staff includes licensed plumbers and gas fitters.\n\n- **Professional Certifications**:\n  - The business holds a valid license from the State of Alabama Plumbers & Gas Fitters Examining Board, which ensures that the work is performed by certified professionals[1].",
  "aboutUs": "Brian Harden Plumbing Inc. is a leading plumbing service provider in the Mobile and Baldwin county areas. Our team of highly skilled and licensed professionals specializes in a comprehensive range of residential and commercial plumbing services, including tankless water heater installation, drain and sewer line repair, backflow prevention, and medical gas pipe services. With a strong local presence, we are dedicated to delivering exceptional workmanship and customer satisfaction throughout our service areas.",
  "whyChooseUs": {
    "mainPitch": "Unparalleled expertise and reliable service for all your plumbing needs.",
    "sellingPoints": [
      "Licensed and certified professionals adhering to the highest industry standards.",
      "Comprehensive range of services, from routine maintenance to complex installations and repairs.",
      "Commitment to prompt response times and efficient project completion."
    ]
  }
}