{
  "slug": "brookside-septic-tank-service-inc",
  "businessName": "Brookside Septic Tank Service Inc",
  "processedImages": 12,
  "totalTokens": 22723,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP-HakzUWdh-n5ow4gCvejhZCi_m_pujHalp2O4=w2048-h2048-k-no",
      "description": "A professional septic service truck with the company's branding, ready to handle septic waste disposal tasks efficiently.",
      "callToAction": "Trust our experienced team for reliable and safe septic tank services."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO_VSl9cMPaEt-L7cFIZ-Ua4ZYbFoxctscrJhZO=w2048-h2048-k-no",
      "description": "A skilled technician in protective gear, carefully inspecting and servicing a septic tank system.",
      "callToAction": "Keep your septic system in top condition with our expert maintenance services."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP0YCXb4Nv46OpahD4r3xtggTGvMZbm78QRSTo5=w2048-h2048-k-no",
      "description": "A residential neighborhood with a septic service truck on site, showcasing the company's commitment to serving local communities.",
      "callToAction": "Protect your home and neighborhood with our professional septic tank cleaning and repair solutions."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP4xGESyLUKN__sa8Tjg5xBQoinYE1BrRLi_9l2=w2048-h2048-k-no",
      "description": "A technician working on a septic system installation, demonstrating the company's expertise in handling complex projects.",
      "reason": "This image highlights the company's capabilities in septic system installation and construction, showcasing their professionalism and attention to detail."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMvzE7aENxJUYVeyvZBvXhw4ou4Q9n9WH04ZBWM=w2048-h2048-k-no",
      "description": "A plumber working on repairing and maintaining a residential septic system, showcasing the company's commitment to customer service.",
      "reason": "This image portrays the company's dedication to providing reliable and efficient septic system repair and maintenance services for homeowners."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJNXlekSCbJ0ERjtG2r3D36CA",
      "name": "Gary Morton",
      "text": "They came out and put a brand new septic system in one day very professional and it’s all done right with great quality! They even fixed my hot water heater while they was here. They also provided a lot of other service im sure are well worth it 10/10 would recommend!",
      "textTranslated": null,
      "publishAt": "a year ago",
      "publishedAtDate": "2023-03-28T13:15:45.293Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNSd3QyQXBnRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSd3QyQXBnRRAB!2m1!1s0x0:0x20e8f770afb6d18e!3m1!1s2@1:CIHM0ogKEICAgICRwt2ApgE%7CCgwIgdGLoQYQkMf_iwE%7C?hl=en",
      "reviewerId": "100707812355373439813",
      "reviewerUrl": "https://www.google.com/maps/contrib/100707812355373439813?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjXndZjPAW_zPi5WlYwYp2_0pa8PAaYOybmK73ukTtCfeQnxhJA=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 2,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJNXlekSCbJ0ERjtG2r3D36CA",
      "location": {
        "lat": 33.5313975,
        "lng": -86.8504715
      },
      "address": null,
      "categoryName": "Septic system service",
      "categories": [
        "Septic system service",
        "Drainage service",
        "Service establishment",
        "Plumber"
      ],
      "title": "Brookside Septic Tank Service Inc",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Brookside%20Septic%20Tank%20Service%20Inc&query_place_id=ChIJNXlekSCbJ0ERjtG2r3D36CA",
      "price": null,
      "cid": "2371417267166957966",
      "fid": "0x41279b20915e7935:0x20e8f770afb6d18e",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipMr_-MK9bbjzNABTUGpwUFbagMkJdEayp44DqOw=w671-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [
    "septic system",
    "hot water heater"
  ],
  "firstReviewDate": "2023-03-28",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "### Business Information:\n\n**Alabama Business Registration/License Details:**\n- Brookside Septic Tank Service Inc. holds several licenses issued by relevant Alabama authorities. They have a license number **MP-3374** issued by the State of Alabama Plumbers & Gas Fitters Examining Board, with an expiration date of 12/31/2024. Additionally, they hold licenses **Pumper #878**, **Installer #877**, **Pumper #874**, and **Installer #873** from the Alabama Onsite Wastewater Board, all expiring on 12/31/2024[1].\n\n**Physical Location and Service Areas:**\n- The business is located at 600 Pickle Dr, Birmingham, AL 35214-1074. They serve the Birmingham area and surrounding locations, including Vestavia Hills, Homewood, Mountain Brook, Center Point, Gardendale, Irondale, and others[1][2][5].\n\n**Hours and Payment Methods:**\n- The specific business hours are not listed, but they accept cash as a payment method[1].\n\n**Years in Operation:**\n- Brookside Septic Tank Service Inc. has been in business since February 2, 1972, and was incorporated on September 28, 1989. This makes them over 52 years in operation[1].\n\n### Services & Specialties:\n\n**Types of Services Offered:**\n- The business provides a wide range of services including septic tank installation, septic tank pumping, septic tank cleaning, plumbing renovation, backflow testing, sewer cleaning, sewer contractors, water heater repair, sump pump contractors, tankless water heaters, commercial plumbing, leak detection, water heater dealers, septic tank treatment, plumbing fixtures, sewer inspection, household garbage disposal, septic system design, grease traps, water heater parts, grease pumping, sewage disposal, and sewage treatment equipment[1][5].\n\n**Service Areas Covered:**\n- They serve residential and commercial clients in Birmingham and the surrounding areas[1][4][5].\n\n**Emergency Service Availability:**\n- While not explicitly stated, the business is available for emergency septic tank services and sewer line issues, indicating they can handle urgent situations[5].\n\n**Prices or Rates:**\n- The business offers free estimates on all services, but specific prices or rates are not provided in the available information[5].\n\n### Customer Reviews & Reputation:\n\n**Review Summaries with Specific Examples:**\n- Customers have praised the excellent service and work quality. For example, one review mentions that \"the guys that done the work did an excellent job\" and recommends the service[3].\n\n**BBB Rating and Status:**\n- Brookside Septic Tank Service Inc. is BBB Accredited since September 10, 2021, and holds an A+ BBB rating[1].\n\n**Common Customer Feedback Themes:**\n- Positive feedback often highlights the excellent service, skilled workers, and satisfactory completion of work[3].\n\n**Response to Reviews:**\n- There is no specific information available on how the business responds to reviews, but their positive rating suggests a good customer service approach[1].\n\n### Owner & Staff:\n\n**Owner/Management Information:**\n- The business is owned by Mr. Eddie Pickle, with Mr. Scott Pickle as a co-owner. Mr. Eddie Pickle is also listed as the principal and customer contact[1].\n\n**Staff Qualifications:**\n- The business is family-owned and operated, with a team that includes skilled plumbers. However, specific staff qualifications beyond their licensing are not detailed[1][5].\n\n**Professional Certifications:**\n- The business holds various professional licenses from the State of Alabama Plumbers & Gas Fitters Examining Board and the Alabama Onsite Wastewater Board, indicating that the staff are professionally certified in their field[1].",
  "aboutUs": "Brookside Septic Tank Service Inc. is a leading provider of comprehensive plumbing and septic system solutions for residential and commercial clients in Birmingham and surrounding areas. With a team of highly skilled and licensed professionals, we specialize in septic tank installation, pumping, cleaning, and repair, as well as a wide range of plumbing services including sewer line maintenance, water heater repair, and leak detection. Our local expertise and commitment to excellence ensure top-quality service tailored to your specific needs.",
  "whyChooseUs": {
    "mainPitch": "Unmatched expertise and reliability for all your plumbing and septic system needs in the Birmingham area.",
    "sellingPoints": [
      "Licensed and certified professionals with extensive knowledge of local regulations and best practices.",
      "Comprehensive range of services, from septic system design and installation to plumbing renovations and emergency repairs.",
      "Commitment to using the latest techniques and equipment to deliver efficient, long-lasting solutions."
    ]
  }
}