{
  "slug": "homeworx",
  "businessName": "Homeworx",
  "processedImages": 12,
  "totalTokens": 29968,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPwgkIHJtE2Fl05EbK8V99Qla-2WNDxTmdroMU4=w2048-h2048-k-no",
      "description": "This image showcases a stunning lakefront property with a breathtaking view of the water and surrounding homes. The large windows and open floor plan create a bright and inviting living space.",
      "callToAction": "Elevate your living experience with our expert window installation and home renovation services."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPS7tsJD1fbIp6llrcHB0XTcw3AP5zj37jhycOy=w2048-h2048-k-no",
      "description": "This before-and-after comparison highlights the remarkable transformation of a dated ranch-style home into a modern and inviting retreat. The exterior renovation has given the property a fresh, contemporary look.",
      "callToAction": "Unlock the full potential of your home with our comprehensive renovation solutions."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOOHYVVDqdtGG9i1Ckt_Pfzw6-R78GERqI8S0C-=w2048-h2048-k-no",
      "description": "This image captures the progress of an extensive home renovation project. The brick exterior and new metal roof demonstrate the attention to detail and quality craftsmanship provided by the company.",
      "callToAction": "Trust our experienced team to bring your dream home to life with our expert renovation services."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPATk5sHDW3Kpcjy407n0mV-thvKBfVyw4TvKyK=w2048-h2048-k-no",
      "description": "This image showcases the company's expertise in exterior home improvements. The newly installed wooden fence adds privacy and enhances the curb appeal of the property.",
      "reasonForAboutUs": "This image demonstrates the company's ability to provide high-quality exterior renovations and enhancements, highlighting their attention to detail and commitment to customer satisfaction."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMbxk2P671zQZNt2qNpKaqpbmOKg1bbWMCmfQlk=w2048-h2048-k-no",
      "description": "This before-and-after comparison showcases the company's skill in transforming outdated bathrooms into modern, functional spaces. The new tiled shower and updated fixtures create a luxurious and inviting atmosphere.",
      "reasonForAboutUs": "This image highlights the company's proficiency in bathroom renovations, showcasing their ability to create beautiful and functional spaces that meet the client's needs and exceed their expectations."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJce68Wq5CBwERoxOrUgi-93U",
      "name": "Joshua Purser",
      "text": "Barry and his crew showed up early , knocked out a 200 foot fence for us in half a day . I’m a very picky person , woth that being said . I couldn’t find a flaw . These guys are as top notch as they come !",
      "textTranslated": null,
      "publishAt": "2 years ago",
      "publishedAtDate": "2022-02-20T22:18:14.738Z",
      "likesCount": 0,
      "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNXM08tcU1REAE",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNXM08tcU1REAE!2m1!1s0x0:0x75f7be0852ab13a3!3m1!1s2@1:CIHM0ogKEICAgICW3O-qMQ%7CCgwIpvzKkAYQyNj23wI%7C?hl=en",
      "reviewerId": "110698583535348057780",
      "reviewerUrl": "https://www.google.com/maps/contrib/110698583535348057780?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjVw-dw1eo_d4C2ZLLw_SAQtov0rzm7EsZQhYqFT5nneyllnN6M=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 2,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": "2022-02-20T23:26:33.000Z",
      "responseFromOwnerText": "Thank you for the positive review.  We appreciate your business!",
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJce68Wq5CBwERoxOrUgi-93U",
      "location": {
        "lat": 34.4853404,
        "lng": -87.2828579
      },
      "address": null,
      "categoryName": "Remodeler",
      "categories": [
        "Remodeler",
        "Bathroom remodeler",
        "Carpenter",
        "Service establishment",
        "Kitchen remodeler"
      ],
      "title": "Homeworx",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Homeworx&query_place_id=ChIJce68Wq5CBwERoxOrUgi-93U",
      "price": null,
      "cid": "8500471764641059747",
      "fid": "0x10742ae5abcee71:0x75f7be0852ab13a3",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOkzerBpBbVnpeGxV0ctj3oPCZ720vNbkBBIlx-=w408-h306-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [
    "fence"
  ],
  "firstReviewDate": "2022-02-20",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for the specific Alabama plumbing business named \"Homeworx\":\n\n## Business Information:\n- **Alabama Business Registration/License Details**: There is no specific information available in the provided sources regarding the business registration or license details of Homeworx. However, plumbing contractors in Alabama are generally required to have a State of Alabama license and may need to register with local authorities, such as obtaining a business license and possibly a surety bond, as indicated in the Opelika business license information[1][5].\n- **Physical Location and Service Areas**: The Google Place ID and phone number suggest that Homeworx is located in Alabama, but the exact physical location is not specified in the provided sources. The service areas are also not explicitly mentioned.\n- **Hours and Payment Methods**: There is no information available on the hours of operation or payment methods for Homeworx.\n- **Years in Operation**: The provided sources do not specify how long Homeworx has been in operation.\n\n## Services & Specialties:\n- **Types of Services Offered**: The sources do not provide detailed information on the types of services offered by Homeworx. However, given the context, it is reasonable to infer that Homeworx might offer plumbing services, but this is not explicitly confirmed.\n- **Service Areas Covered**: As mentioned, the service areas are not specified.\n- **Emergency Service Availability**: There is no information available on whether Homeworx offers emergency services.\n- **Any Listed Prices or Rates**: No pricing or rate information is available for Homeworx.\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: With only one review and a rating of 5, there are no detailed summaries or specific examples available.\n- **BBB Rating and Status**: There is no BBB rating or status information available for this specific Homeworx business. The BBB profile mentioned in the sources refers to a different business named \"Home-Worx Inspection Services\" in Fairhope, AL, which is not related to this plumbing business[3].\n- **Common Customer Feedback Themes**: Given the lack of multiple reviews, there are no common customer feedback themes to report.\n- **Response to Reviews**: There is no information available on how the business responds to reviews.\n\n## Owner & Staff:\n- **Owner/Management Information**: The owner or management details for Homeworx are not provided in the sources.\n- **Staff Qualifications**: There is no information available on the qualifications of the staff.\n- **Professional Certifications**: No information is available regarding any professional certifications held by the staff or owner of Homeworx.\n\nIn summary, the provided sources do not offer detailed information about this specific Homeworx business in Alabama, and most of the requested details remain unknown.",
  "aboutUs": "At Homeworx, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch services to our local community. With our extensive expertise and commitment to excellence, we specialize in a wide range of plumbing solutions, from routine maintenance and repairs to complex installations and renovations. Our local presence and deep understanding of the area's plumbing needs ensure that we deliver tailored solutions that meet your unique requirements.",
  "whyChooseUs": {
    "mainPitch": "Homeworx is your trusted partner for all your plumbing needs, offering unparalleled expertise, reliable service, and a commitment to customer satisfaction.",
    "sellingPoints": [
      "Highly trained and certified technicians with extensive knowledge of the latest plumbing techniques and technologies.",
      "Prompt and efficient service, with a focus on minimizing disruptions and ensuring your plumbing systems are functioning optimally.",
      "Comprehensive range of plumbing services, from routine maintenance and repairs to complex installations and renovations, all delivered with meticulous attention to detail."
    ]
  }
}