{
  "slug": "lance-of-all-trades",
  "businessName": "Lance of All Trades",
  "processedImages": 12,
  "totalTokens": 13345,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP9d6I7m1FK459V_aa9hefbk4XcVrEltZEKL5MW=w2048-h2048-k-no",
      "description": "A professional plumber working on a residential plumbing project, showcasing the company's expertise in providing reliable and efficient plumbing services.",
      "callToAction": "Trust our skilled technicians to handle all your plumbing needs with precision and care."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMmG2ILChjX8W940XoOhj5iOL8x1sI7ENs_dCKe=w2048-h2048-k-no",
      "description": "A scenic view of a well-maintained residential property, highlighting the company's commitment to delivering high-quality work that enhances the overall aesthetic of the client's home.",
      "callToAction": "Enhance the beauty and functionality of your home with our top-notch plumbing solutions."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNdH1MIFEfPiD4V7tKsGFsJcY-kotPM4lviu71N=w2048-h2048-k-no",
      "description": "A skilled plumber performing maintenance work, demonstrating the company's dedication to providing comprehensive plumbing services to ensure the longevity and optimal performance of your plumbing systems.",
      "callToAction": "Protect your investment with our preventative maintenance services, ensuring your plumbing systems operate smoothly for years to come."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOMUrpkxRLhH-ReYAII1tlDjvdOJQxXDZZniTfk=w2048-h2048-k-no",
      "description": "A cozy and inviting residential interior, showcasing the company's ability to seamlessly integrate plumbing solutions into any living space while maintaining a comfortable and aesthetically pleasing environment.",
      "reason": "This image highlights the company's commitment to delivering high-quality work that enhances the overall living experience for their clients."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP8cGw-rXadDroQHyTtQ6ZtJqxW458z_tyLxc67=w2048-h2048-k-no",
      "description": "A well-organized workspace with essential tools and equipment, reflecting the company's professionalism, attention to detail, and dedication to providing efficient and reliable plumbing services.",
      "reason": "This image demonstrates the company's expertise, preparedness, and commitment to delivering top-notch plumbing solutions to their clients."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Lance of All Trades\" (ID: ChIJOU-3SHNH-24R968ZYSb7Gs4) has no reviews",
      "searchString": "place_id:ChIJOU-3SHNH-24R968ZYSb7Gs4",
      "isAdvertisement": false,
      "placeId": "ChIJOU-3SHNH-24R968ZYSb7Gs4",
      "location": {
        "lat": 32.45106,
        "lng": -85.028431
      },
      "address": null,
      "categoryName": "Fence contractor",
      "categories": [
        "Fence contractor",
        "Appliance store",
        "Contractor",
        "Service establishment",
        "Fence supply store",
        "Handyman/Handywoman/Handyperson",
        "Plumber",
        "Sheet metal contractor"
      ],
      "title": "Lance of All Trades",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Lance%20of%20All%20Trades&query_place_id=ChIJOU-3SHNH-24R968ZYSb7Gs4",
      "price": null,
      "cid": "14851458863464034295",
      "fid": "0x6efb477348b74f39:0xce1afb266119aff7",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipN6fRcus8ZSGwKC6akH_qglmNg8bIA_41B0NBXR=w408-h544-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "### Business Information:\n\n- **Alabama Business Registration/License Details**:\n  There is no specific information available from the provided sources regarding the Alabama business registration or license details for \"Lance of All Trades.\" However, you can check the Alabama Secretary of State's Government Records Inquiry System for more detailed information on business registrations[4].\n\n- **Physical Location and Service Areas**:\n  \"Lance of All Trades\" is located at 2702 13th Avenue, Phenix City, AL 36867. The service area is not explicitly stated, but it is implied to be around Phenix City and possibly surrounding areas[5].\n\n- **Hours and Payment Methods**:\n  The service hours are not specified in the provided sources. For further information on hours and payment methods, you would need to contact the business directly[5].\n\n- **Years in Operation**:\n  There is no information available on how many years \"Lance of All Trades\" has been in operation.\n\n### Services & Specialties:\n\n- **Types of Services Offered**:\n  \"Lance of All Trades\" offers services including fencing, drainage & sewage services, and electrical outlet & appliance installation services[5].\n\n- **Service Areas Covered**:\n  As mentioned, the service area appears to be around Phenix City, AL, but the exact coverage is not detailed.\n\n- **Emergency Service Availability**:\n  There is no information provided on whether \"Lance of All Trades\" offers emergency services.\n\n- **Any Listed Prices or Rates**:\n  No prices or rates are listed in the available sources. You would need to contact the business directly for this information[5].\n\n### Customer Reviews & Reputation:\n\n- **Review Summaries with Specific Examples**:\n  There are no customer reviews or ratings available in the provided sources specifically for \"Lance of All Trades\" in Phenix City, AL.\n\n- **BBB Rating and Status**:\n  There is no information available on the BBB rating or status for this business.\n\n- **Common Customer Feedback Themes**:\n  Without specific reviews, it is not possible to identify common customer feedback themes.\n\n- **Response to Reviews**:\n  There is no information on how the business responds to reviews.\n\n### Owner & Staff:\n\n- **Owner/Management Information**:\n  The business is titled \"Lance of All Trades,\" indicating that the owner or manager is likely named Lance, but no further details are provided[5].\n\n- **Staff Qualifications**:\n  There is no information available on the qualifications of the staff.\n\n- **Professional Certifications**:\n  No information is provided on any professional certifications held by the owner or staff of \"Lance of All Trades\"[5].",
  "aboutUs": "At Lance of All Trades, we are a team of highly skilled and experienced professionals dedicated to providing top-notch plumbing, fencing, drainage, and electrical services to the Phenix City community. With our extensive expertise and commitment to excellence, we specialize in tackling even the most complex projects, ensuring a seamless and efficient experience for our valued customers.",
  "whyChooseUs": {
    "mainPitch": "Unparalleled expertise and unwavering commitment to delivering exceptional local service.",
    "sellingPoints": [
      "Comprehensive range of services, from plumbing and drainage to fencing and electrical work, all under one roof.",
      "Meticulous attention to detail and adherence to industry best practices, ensuring quality workmanship on every job.",
      "Prompt and reliable service, with a focus on minimizing disruptions and maximizing customer convenience."
    ]
  }
}