{
  "slug": "martin-renovation",
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Martin renovation\" (ID: ChIJbYsPRcP0a4wRCBneYShi78k) has no reviews",
      "searchString": "place_id:ChIJbYsPRcP0a4wRCBneYShi78k",
      "isAdvertisement": false,
      "placeId": "ChIJbYsPRcP0a4wRCBneYShi78k",
      "location": {
        "lat": 34.784582,
        "lng": -87.6318274
      },
      "address": null,
      "categoryName": "Remodeler",
      "categories": [
        "Remodeler",
        "Service establishment"
      ],
      "title": "Martin renovation",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Martin%20renovation&query_place_id=ChIJbYsPRcP0a4wRCBneYShi78k",
      "price": null,
      "cid": "14550956846637521160",
      "fid": "0x8c6bf4c3450f8b6d:0xc9ef622861de1908"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, it appears that there is no specific information available for a business named \"Martin renovation\" with the phone number +1 256-633-3837 and the Google Place ID ChIJbYsPRcP0a4wRCBneYShi78k. Here are some key points to consider:\n\n## Business Information\n- There is no mention of a business named \"Martin renovation\" in the provided sources or any other readily available online databases that match the given identifiers.\n- Without specific registration or licensing details, physical location, hours, payment methods, or years in operation, it is not possible to provide detailed business information.\n\n## Services & Specialties\n- Since the business is not identified in the sources, there is no information available on the types of services offered, service areas covered, emergency service availability, or any listed prices or rates.\n\n## Customer Reviews & Reputation\n- There are no customer reviews or reputation data available for this specific business, as it does not appear in the provided sources or other verifiable databases.\n- There is no BBB rating or status for \"Martin renovation\" with the given identifiers.\n\n## Owner & Staff\n- There is no information available on the owner, management, staff qualifications, or professional certifications for this business.\n\nGiven the lack of specific information matching the provided identifiers, it is clear that the business \"Martin renovation\" with the phone number +1 256-633-3837 and the specified Google Place ID does not have a presence in the sources provided or other easily accessible databases. To obtain detailed information, you may need to contact the business directly or check local business registries and licensing boards.",
  "aboutUs": "Our expert plumbing team specializes in comprehensive residential and commercial services for the local area. With a focus on quality workmanship and customer satisfaction, we offer a wide range of plumbing solutions, from routine maintenance to complex installations and repairs. Trust our skilled technicians to handle all your plumbing needs efficiently and professionally.",
  "whyChooseUs": {
    "mainPitch": "Reliable and knowledgeable plumbing experts dedicated to delivering top-notch service for your home or business.",
    "sellingPoints": [
      "Highly trained and certified technicians with extensive experience in all aspects of plumbing",
      "Prompt and courteous service, with a commitment to arriving on time and completing work efficiently",
      "Transparent pricing and upfront cost estimates, ensuring no hidden fees or surprises"
    ]
  }
}