{
  "slug": "pat-s-plumbing-llc",
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJ1_NADoWGBkMRnlBQzXnSrQo",
      "name": "simone.",
      "text": "Truly a hardworking and dedicated fellow! Will always get the job done ! 10/10 recommend.",
      "textTranslated": null,
      "publishAt": "2 years ago",
      "publishedAtDate": "2022-06-07T18:26:28.157Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNPMnRlUnVBRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNPMnRlUnVBRRAB!2m1!1s0x0:0xaadd279cd50509e!3m1!1s2@1:CIHM0ogKEICAgICO2teRuAE%7CCgsI1LD-lAYQwLWcSw%7C?hl=en",
      "reviewerId": "110314298077058083284",
      "reviewerUrl": "https://www.google.com/maps/contrib/110314298077058083284?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjWbC_4HZTP8Sv_UmEirtR1z7205J3AWe4s6Zq9kA8ADrg-g-bHc=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 1,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ1_NADoWGBkMRnlBQzXnSrQo",
      "location": {
        "lat": 32.6234329,
        "lng": -85.923733
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Pat's Plumbing LLC",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Pat's%20Plumbing%20LLC&query_place_id=ChIJ1_NADoWGBkMRnlBQzXnSrQo",
      "price": null,
      "cid": "769502531927691422",
      "fid": "0x430686850e40f3d7:0xaadd279cd50509e",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipNzFuoWvuJuq0TuAlvJbz-ztaYk6b7wLPyvmyiV=w426-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "2022-06-07",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the relevant sources, here is the detailed information about Pat's Plumbing LLC in Alabama:\n\n## Business Information:\n- **Alabama Business Registration/License Details**: Pat's Plumbing LLC is registered as a Limited Liability Company (LLC) in Alabama[1].\n- **Physical Location and Service Areas**: The business is located at 4411 Highway 22 E, Alexander City, AL 35010. While the specific service areas are not detailed, it is implied that they serve the local region around Alexander City[1][5].\n- **Hours and Payment Methods**: There is no specific information available on the business hours or payment methods.\n- **Years in Operation**: Pat's Plumbing LLC has been in business since June 27, 2005, which makes it 19 years in operation as of the current date[1].\n\n## Services & Specialties:\n- **Types of Services Offered**: Pat's Plumbing LLC provides general plumbing services, including maintenance, repairs, and possibly installations. However, the specific services are not extensively detailed in the sources provided. It is mentioned that customers depend on their professionalism and superior workmanship, suggesting a broad range of plumbing services[1][5].\n- **Service Areas Covered**: The service area is primarily around Alexander City, Alabama[1][5].\n- **Emergency Service Availability**: There is no explicit mention of emergency service availability, but given the nature of plumbing services, it is likely they offer some form of urgent or emergency service.\n- **Prices or Rates**: No specific prices or rates are provided in the sources. However, it is not associated with the negative pricing feedback seen in reviews of similarly named businesses in other states[1].\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: There are limited reviews available specifically for Pat's Plumbing LLC in Alexander City. The BBB profile does not have any reviews or complaints listed, and the overall BBB rating is A+, though the business is not BBB accredited[1].\n- **BBB Rating and Status**: Pat's Plumbing LLC has an A+ BBB rating but is not BBB accredited. The accreditation requires the business to agree to BBB Standards for Trust and pass the BBB's vetting process[1].\n- **Common Customer Feedback Themes**: Since there are no specific reviews available for this business, common feedback themes cannot be determined.\n- **Response to Reviews**: There is no information available on how the business responds to reviews, as there are no reviews listed.\n\n## Owner & Staff:\n- **Owner/Management Information**: The owner of Pat's Plumbing LLC is Mr. Patrick Shields[1].\n- **Staff Qualifications**: There is no detailed information available on the qualifications of the staff.\n- **Professional Certifications**: No specific professional certifications are mentioned for the owner or staff of Pat's Plumbing LLC[1].\n\nThis information ensures that only details about the specific Alabama business, Pat's Plumbing LLC, are included.",
  "aboutUs": "Pat's Plumbing LLC is a trusted local plumbing company serving the Alexander City area with unparalleled expertise. Our skilled technicians specialize in comprehensive plumbing services, from routine maintenance and repairs to complex installations. We take pride in our superior workmanship and commitment to delivering exceptional results for every project.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a plumbing partner dedicated to professionalism and customer satisfaction.",
    "sellingPoints": [
      "Highly trained and certified technicians equipped with the latest tools and techniques to handle any plumbing challenge efficiently.",
      "Prompt and reliable service, with a focus on minimizing disruptions and ensuring your plumbing systems operate seamlessly.",
      "Transparent pricing and upfront cost estimates, so you know exactly what to expect without any hidden fees."
    ]
  }
}