{
  "slug": "peck-plumbing",
  "businessName": "Peck Plumbing",
  "processedImages": 12,
  "totalTokens": 29964,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPy-2DrzXsaQ5CL51z3vx0fqNKv4mujQR7bRMoq=w2048-h2048-k-no",
      "description": "This image showcases the expertise of Peck Plumbing in underground plumbing installations. It depicts a construction site with a network of pipes and drainage systems being meticulously laid out, demonstrating the company's proficiency in handling complex plumbing projects.",
      "callToAction": "Trust Peck Plumbing for your underground plumbing needs. Our skilled professionals ensure a seamless and efficient installation process."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPYb73E5mgqyvR8brNHArTm9oVzJaF6Xf1Tl8UA=w2048-h2048-k-no",
      "description": "This image highlights the versatility of Peck Plumbing in handling both residential and commercial projects. It shows a team of workers diligently working on a plumbing installation at a construction site, showcasing the company's ability to tackle projects of various scales.",
      "callToAction": "Rely on Peck Plumbing for all your plumbing needs, whether residential or commercial. Our experienced team delivers top-notch solutions."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP_2xnhJqxZv8bTqI-clcI0ioOvNI9-eLZe2LFy=w2048-h2048-k-no",
      "description": "This image showcases the expertise of Peck Plumbing in bathroom renovations and installations. It features a modern and stylish bathroom setup with high-quality fixtures and finishes, demonstrating the company's commitment to delivering exceptional results.",
      "callToAction": "Elevate your bathroom with Peck Plumbing. Our skilled professionals ensure a seamless and luxurious transformation."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipP0pFJe_BtkdmF1NJeI2iy8V_iFbXTVIcNmLDSh=w2048-h2048-k-no",
      "description": "This image showcases the attention to detail and craftsmanship of Peck Plumbing. It features a well-organized plumbing system with neatly arranged pipes and fittings, highlighting the company's commitment to quality workmanship and professionalism.",
      "reason": "This image effectively demonstrates the company's capabilities in delivering precise and high-quality plumbing installations, making it an excellent choice for the About Us section."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMkrslWYwR0sr1wXKc6m5s-_FTuj9LFrFATebT1=w2048-h2048-k-no",
      "description": "This image showcases the expertise of Peck Plumbing in water heater installations and maintenance. It features two modern water heaters with intricate piping systems, highlighting the company's proficiency in handling complex plumbing systems.",
      "reason": "By showcasing their expertise in water heater installations, this image effectively conveys Peck Plumbing's comprehensive range of services, making it a suitable choice for the About Us section."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Peck Plumbing\" (ID: ChIJRffU5ws7YogRR_gqnTEGuts) has no reviews",
      "searchString": "place_id:ChIJRffU5ws7YogRR_gqnTEGuts",
      "isAdvertisement": false,
      "placeId": "ChIJRffU5ws7YogRR_gqnTEGuts",
      "location": {
        "lat": 34.9261602,
        "lng": -86.4549049
      },
      "address": "770 New Market Rd, New Market, AL 35761",
      "neighborhood": null,
      "street": "770 New Market Rd",
      "city": "New Market",
      "postalCode": "35761",
      "state": "Alabama",
      "countryCode": "US",
      "categoryName": "Plumber",
      "categories": [
        "Plumber"
      ],
      "title": "Peck Plumbing",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Peck%20Plumbing&query_place_id=ChIJRffU5ws7YogRR_gqnTEGuts",
      "price": null,
      "cid": "15832974250134403143",
      "fid": "0x88623b0be7d4f745:0xdbba06319d2af847",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipP_2xnhJqxZv8bTqI-clcI0ioOvNI9-eLZe2LFy=w408-h306-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "### Business Information:\n\n#### Alabama Business Registration/License Details\nTo obtain specific details about Peck Plumbing's business registration or license, you would need to contact the Alabama Plumbers and Gas Fitters Examining Board or use their forms for verification. However, the provided sources do not include direct access to this specific information. You can use the \"Request for Verification of Alabama license/registration\" form from the Alabama Plumbers and Gas Fitters Examining Board to inquire about their licensing status[1].\n\n#### Physical Location and Service Areas\nPeck Plumbing is located at 770 New Market Rd, New Market, AL 35761. The service area appears to be focused around New Market and possibly surrounding areas in northern Alabama, although the exact service area is not explicitly stated in the sources[3][5].\n\n#### Hours and Payment Methods\nThe sources provided do not specify the business hours or payment methods for Peck Plumbing. You would need to contact the business directly for this information.\n\n#### Years in Operation\nThere is no information available in the provided sources regarding how many years Peck Plumbing has been in operation.\n\n### Services & Specialties:\n\n#### Types of Services Offered\nPeck Plumbing specializes in various aspects of plumbing repair, including fixing leaky faucets and pipes, clearing clogged drains, and addressing other pipe-related issues[3][5].\n\n#### Service Areas Covered\nAs mentioned, the service area is centered around New Market, AL, but the exact extent of their service area is not detailed.\n\n#### Emergency Service Availability\nThere is no specific information in the sources indicating whether Peck Plumbing offers emergency services.\n\n#### Prices or Rates\nThe sources do not provide any information on the prices or rates for Peck Plumbing's services.\n\n### Customer Reviews & Reputation:\n\n#### Review Summaries with Specific Examples\nThere are no detailed review summaries or specific examples provided in the sources. To get a comprehensive view of customer reviews, you would need to check review platforms like Google Reviews, Yelp, or the Better Business Bureau (BBB).\n\n#### BBB Rating and Status\nThere is no information available in the sources regarding Peck Plumbing's BBB rating or status.\n\n#### Common Customer Feedback Themes\nWithout access to specific reviews, it is not possible to identify common customer feedback themes.\n\n#### Response to Reviews\nThere is no information on how Peck Plumbing responds to customer reviews.\n\n### Owner & Staff:\n\n#### Owner/Management Information\nThe sources do not provide detailed information about the owner or management of Peck Plumbing beyond the business name and contact details.\n\n#### Staff Qualifications\nThere is no information available regarding the qualifications or certifications of the staff at Peck Plumbing.\n\n#### Professional Certifications\nTo verify professional certifications, you would need to contact the Alabama Plumbers and Gas Fitters Examining Board or request this information directly from the business[1].\n\nGiven the limited information available from the sources, it is recommended to contact Peck Plumbing directly or check additional review and business listing platforms for more detailed information.",
  "aboutUs": "Peck Plumbing is a trusted local plumbing service provider based in New Market, Alabama. Our team of skilled and certified professionals specializes in a wide range of plumbing repair services, from fixing leaky faucets and pipes to clearing clogged drains. With a focus on delivering exceptional workmanship and customer satisfaction, we are committed to serving the plumbing needs of our community.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a reliable and knowledgeable plumbing partner.",
    "sellingPoints": [
      "Prompt and efficient service, ensuring your plumbing issues are resolved quickly and effectively.",
      "Highly trained and certified technicians equipped with the latest tools and techniques to handle any plumbing challenge.",
      "Commitment to using high-quality materials and providing long-lasting solutions for your plumbing needs."
    ]
  }
}