{
  "slug": "performance-plumbing-inc",
  "businessName": "Performance Plumbing, Inc",
  "processedImages": 6,
  "totalTokens": 12907,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNHmWm5i7Bjwoik1D-EH0TABVQw5b4vz4nxn1Rf=w2048-h2048-k-no",
      "description": "Two skilled plumbers installing a modern septic system in a residential area, showcasing their expertise in underground plumbing solutions.",
      "callToAction": "Trust our professionals for reliable septic system installations and maintenance."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOrQzgBb3lze0nBo9icu1Zwz_8Gph1eBDtrWGPH=w2048-h2048-k-no",
      "description": "A nighttime scene of a completed underground plumbing project, highlighting the company's commitment to working around the clock to meet client needs.",
      "callToAction": "Experience seamless plumbing services with our dedicated 24/7 availability."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPDW4eYaCLAb1CmLyfRmg4wGjWL7lIh-WcXIUjO=w2048-h2048-k-no",
      "description": "Plumbers working on a commercial plumbing project, demonstrating their ability to handle complex installations with precision and efficiency.",
      "callToAction": "Upgrade your commercial plumbing with our expert solutions for optimal performance."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOHhmQ70arDWCp88buGL_UM43IR5-MxF_UiEJrd=w2048-h2048-k-no",
      "description": "An interior plumbing project in progress, showcasing the company's attention to detail and commitment to quality workmanship.",
      "reason": "This image highlights the company's professionalism and dedication to delivering top-notch plumbing services, making it an excellent choice for the About Us section."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNvtZN6eBZrgFRVe9VgFTcquogcnV7FGlYNoGp1=w2048-h2048-k-no",
      "description": "A close-up view of plumbing materials and tools, demonstrating the company's use of high-quality equipment and supplies.",
      "reason": "This image showcases the company's commitment to using the best materials and tools, instilling confidence in their ability to provide reliable and long-lasting plumbing solutions."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Performance Plumbing, Inc\" (ID: ChIJ5a-2RAcniYgRQxsl6C7Bk58) has no reviews",
      "searchString": "place_id:ChIJ5a-2RAcniYgRQxsl6C7Bk58",
      "isAdvertisement": false,
      "placeId": "ChIJ5a-2RAcniYgRQxsl6C7Bk58",
      "location": {
        "lat": 33.3683794,
        "lng": -86.8504715
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Performance Plumbing, Inc",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Performance%20Plumbing%2C%20Inc&query_place_id=ChIJ5a-2RAcniYgRQxsl6C7Bk58",
      "price": null,
      "cid": "11498746680814410563",
      "fid": "0x8889270744b6afe5:0x9f93c12ee8251b43",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipPDW4eYaCLAb1CmLyfRmg4wGjWL7lIh-WcXIUjO=w408-h544-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "### Business Information:\n\n**Alabama Business Registration/License Details:**\nPerformance Plumbing, Inc. must be registered with the Alabama Plumbers & Gas Fitters Examining Board, as is required for all plumbing and gas fitting companies in Alabama. However, specific license details are not provided in the sources, but it is implied that they would have a Principal Master designee as required by the board[1][5].\n\n**Physical Location and Service Areas:**\nPerformance Plumbing, Inc. is located at 154 Cove Landing, Calera, AL 35040-3603. The business operates in the local area, but the exact service areas are not explicitly stated, though it is inferred to be within Central and South Alabama given the BBB affiliation[2].\n\n**Hours and Payment Methods:**\nThe specific business hours and payment methods for Performance Plumbing, Inc. are not detailed in the provided sources. However, it is mentioned that they are responsive and can schedule appointments quickly, including same-day service in some cases[3].\n\n**Years in Operation:**\nPerformance Plumbing, Inc. has been in business since June 1, 2005, indicating they have been operating for approximately 19 years as of the current date[2].\n\n### Services & Specialties:\n\n**Types of Services Offered:**\nPerformance Plumbing, Inc. offers a variety of plumbing services, including:\n- Installation and repair of plumbing and gas fitting systems\n- Hot water heater installation and replacement\n- Sump pump replacement\n- Gas pipe adjustments\n- Pool drain repairs\n- General plumbing repairs and maintenance[3].\n\n**Service Areas Covered:**\nWhile the exact service areas are not specified, the business is known to serve the Calera area and surrounding regions within Central and South Alabama[2].\n\n**Emergency Service Availability:**\nThe company is noted for its quick response and ability to provide same-day service for emergency plumbing issues[3].\n\n**Any Listed Prices or Rates:**\nThere is no specific pricing information provided in the sources. However, customers have mentioned that the services are \"very affordable\"[3].\n\n### Customer Reviews & Reputation:\n\n**Review Summaries with Specific Examples:**\nCustomers have praised Performance Plumbing, Inc. for their professionalism, courtesy, and high-quality work. Examples include:\n- Quick and affordable service for various plumbing issues, including hot water heater replacements and sump pump installations.\n- High praise for technicians such as Rick, Spencer, Dillon, and Andy for their expertise and customer service.\n- Customers appreciate the cleanliness and care taken by the technicians to protect their property during work[3].\n\n**BBB Rating and Status:**\nPerformance Plumbing, Inc. is not a BBB Accredited Business. The BBB does not have sufficient information to issue a rating for this business[2].\n\n**Common Customer Feedback Themes:**\nCommon themes include:\n- Professionalism and courtesy of the technicians\n- High-quality workmanship\n- Affordability\n- Quick response times\n- Attention to detail and care for customer property[3].\n\n**Response to Reviews:**\nThere is no specific information on how the company responds to reviews, but the positive feedback suggests a strong customer service focus.\n\n### Owner & Staff:\n\n**Owner/Management Information:**\nThe business is managed by Mr. Michael Reed Jr., who is listed as the principal contact and customer contact[2].\n\n**Staff Qualifications:**\nWhile specific qualifications are not detailed, the staff, including technicians like Rick, Spencer, Dillon, and Andy, are described as highly professional, knowledgeable, and skilled in their work[3].\n\n**Professional Certifications:**\nGiven the requirement for a Principal Master designee and the positive customer feedback, it is likely that the staff holds necessary certifications and licenses, but this is not explicitly stated in the sources[1][5].",
  "aboutUs": "Performance Plumbing, Inc. is a leading plumbing and gas fitting company serving the Calera area and surrounding regions of Central and South Alabama. Our team of highly skilled and certified technicians specializes in a wide range of services, including plumbing system installation and repair, hot water heater replacement, sump pump services, gas pipe adjustments, and pool drain repairs. With a commitment to excellence and a focus on local service, we provide top-notch solutions for all your plumbing needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the ultimate in plumbing expertise and customer satisfaction with Performance Plumbing, Inc.",
    "sellingPoints": [
      "Rapid response times, with same-day service available for emergencies, ensuring your plumbing issues are resolved promptly.",
      "Meticulous attention to detail and care for your property, with technicians who take pride in their work and leave your space clean and protected.",
      "Comprehensive plumbing solutions, from installations and repairs to maintenance and specialized services like pool drain repairs and gas pipe adjustments."
    ]
  }
}