{
  "slug": "plumbing-dog",
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJ3zU7eWvTkaURB54Herf01mY",
      "name": "Sherrie Woodcook",
      "text": "Absolutely will use this service again! Very good communication in quoting job & continued communicating every step of project. Already planning addition of water filtration service w/ this busines!",
      "textTranslated": null,
      "publishAt": "3 years ago",
      "publishedAtDate": "2021-06-22T16:15:18.529Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUNxajlETDJ3RRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNxajlETDJ3RRAB!2m1!1s0x0:0x66d6f4b77a079e07!3m1!1s2@1:CIHM0ogKEICAgICqj9DL2wE%7CCgwIlpnIhgYQ8MHH_AE%7C?hl=en",
      "reviewerId": "112556093611382409202",
      "reviewerUrl": "https://www.google.com/maps/contrib/112556093611382409202?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocLW-i52V8zikNdVMujA-FuKZp_mwpQicUgt8HBDuOEWBWsoRg=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 1,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": "2021-06-22T16:28:49.000Z",
      "responseFromOwnerText": "Thank you so much for your feedback.",
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ3zU7eWvTkaURB54Herf01mY",
      "location": {
        "lat": 33.546173,
        "lng": -86.5681284
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Plumbing Dog",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Plumbing%20Dog&query_place_id=ChIJ3zU7eWvTkaURB54Herf01mY",
      "price": null,
      "cid": "7410379305748241927",
      "fid": "0xa591d36b793b35df:0x66d6f4b77a079e07",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipP6uFpu3ySGDIzrzPNVDx7VHL7VhYFj4iPIcGXc=w423-h240-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [
    "water filtration service"
  ],
  "firstReviewDate": "2021-06-22",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for the specific Alabama plumbing business named \"Plumbing Dog\":\n\n## Business Information\n- **Alabama business registration/license details**: There is no specific information available in the provided sources regarding the business registration or license details of \"Plumbing Dog\".\n- **Physical location and service areas**: The exact physical location of \"Plumbing Dog\" is not specified in the provided sources. However, the Google Place ID suggests it is located in Alabama, but the precise location is not given.\n- **Hours and payment methods**: No information is available on the hours of operation or payment methods for \"Plumbing Dog\".\n- **Years in operation**: There is no data available on how long \"Plumbing Dog\" has been in operation.\n\n## Services & Specialties\n- **Types of services offered**: There is no detailed information available on the types of services offered by \"Plumbing Dog\".\n- **Service areas covered**: The service areas covered by \"Plumbing Dog\" are not specified.\n- **Emergency service availability**: No information is available regarding whether \"Plumbing Dog\" offers emergency services.\n- **Any listed prices or rates**: There are no listed prices or rates available for \"Plumbing Dog\".\n\n## Customer Reviews & Reputation\n- **Review summaries with specific examples**: With only 1 review and a 5-star rating, there is limited information. However, no specific review content is available from the provided sources.\n- **BBB rating and status**: There is no BBB rating or status information available for \"Plumbing Dog\" in the provided sources.\n- **Common customer feedback themes**: Given the single review, no common themes can be identified.\n- **Response to reviews**: There is no information available on how \"Plumbing Dog\" responds to customer reviews.\n\n## Owner & Staff\n- **Owner/management information**: The owner or management details of \"Plumbing Dog\" are not provided in the sources.\n- **Staff qualifications**: There is no information available on the qualifications of the staff at \"Plumbing Dog\".\n- **Professional certifications**: No details on professional certifications held by the staff or owner of \"Plumbing Dog\" are available.\n\nGiven the lack of specific information in the provided sources, it appears that detailed data on \"Plumbing Dog\" is not readily available through these resources. Additional research or direct contact with the business may be necessary to gather more comprehensive information.",
  "aboutUs": "Plumbing Dog is a trusted local plumbing company serving communities across Alabama. Our team of highly skilled and certified professionals specializes in a wide range of plumbing services, from routine maintenance and repairs to complex installations and emergency services. With a deep commitment to excellence and customer satisfaction, we leverage our expertise to deliver reliable, efficient solutions tailored to your unique needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing Plumbing Dog, your reliable partner for all your plumbing needs.",
    "sellingPoints": [
      "Rapid response times for emergency situations, ensuring your plumbing issues are addressed promptly.",
      "Comprehensive services covering everything from drain cleaning to water heater installation, all under one roof.",
      "Highly trained and certified technicians equipped with the latest tools and techniques to tackle any plumbing challenge."
    ]
  }
}