{
  "slug": "plumbplus-company",
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJ8SVDJrTOMKwR0LFCLICWFmw",
      "name": "Altrise Jones",
      "text": "Outstanding drain clean out and unclogged shampoo bowl pipes and reinstalled, response was quick and professional!!!",
      "textTranslated": null,
      "publishAt": "10 months ago",
      "publishedAtDate": "2024-02-17T15:05:41.656Z",
      "likesCount": 0,
      "reviewId": "ChZDSUhNMG9nS0VJQ0FnSUNkdmR5MWFBEAE",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNkdmR5MWFBEAE!2m1!1s0x0:0x6c1696802c42b1d0!3m1!1s2@1:CIHM0ogKEICAgICdvdy1aA%7CCgwIxZbDrgYQqJ73uAI%7C?hl=en",
      "reviewerId": "100562713907305154456",
      "reviewerUrl": "https://www.google.com/maps/contrib/100562713907305154456?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjUOBGxH4znefQOl19VCJvAmbOKqHHVtf8TggnK4HEaiTsIt7aU=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 19,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJ8SVDJrTOMKwR0LFCLICWFmw",
      "location": {
        "lat": 34.6992935,
        "lng": -86.6780524
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Plumbplus Company",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Plumbplus%20Company&query_place_id=ChIJ8SVDJrTOMKwR0LFCLICWFmw",
      "price": null,
      "cid": "7788578082826400208",
      "fid": "0xac30ceb4264325f1:0x6c1696802c42b1d0"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [
    "drain clean out",
    "unclogged shampoo bowl pipes",
    "reinstalled"
  ],
  "firstReviewDate": "2024-02-17",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 1,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information that could be verified for the specific Alabama plumbing business, Plumbplus Company:\n\n## Business Information\n- **Alabama Business Registration/License Details**: There is no specific information available in the provided sources about Plumbplus Company's business registration or license details. However, according to Alabama regulations, plumbing companies must be registered with the Alabama Plumbers & Gas Fitters Examining Board[5].\n- **Physical Location and Service Areas**: The Google Place ID and phone number suggest that Plumbplus Company is located in Alabama, but the exact physical location and service areas are not specified in the provided sources.\n- **Hours and Payment Methods**: There is no information available on the hours of operation or payment methods for Plumbplus Company.\n- **Years in Operation**: No information is available on how long Plumbplus Company has been in operation.\n\n## Services & Specialties\n- **Types of Services Offered**: There is no detailed information available on the types of services offered by Plumbplus Company.\n- **Service Areas Covered**: As mentioned, the service areas are not specified.\n- **Emergency Service Availability**: There is no information on whether Plumbplus Company offers emergency services.\n- **Any Listed Prices or Rates**: No pricing or rate information is available for Plumbplus Company.\n\n## Customer Reviews & Reputation\n- **Review Summaries with Specific Examples**: With only 1 review and a 5-star rating, there is limited information. However, the single review indicates a positive experience but does not provide specific details.\n- **BBB Rating and Status**: There is no information available on the Better Business Bureau (BBB) rating or status for Plumbplus Company.\n- **Common Customer Feedback Themes**: Given the single review, no common themes can be identified.\n- **Response to Reviews**: There is no information on how Plumbplus Company responds to reviews.\n\n## Owner & Staff\n- **Owner/Management Information**: The owner or management details of Plumbplus Company are not available in the provided sources.\n- **Staff Qualifications**: There is no information on the qualifications or professional certifications of the staff at Plumbplus Company.\n- **Professional Certifications**: No information is available on any professional certifications held by the staff or owner of Plumbplus Company.\n\nGiven the lack of detailed information in the provided sources, it is recommended to check the business's official website, social media, or contact them directly for more specific details. Additionally, the Alabama Secretary of State's office and the Alabama Plumbers & Gas Fitters Examining Board could be contacted for registration and licensing information[4][5].",
  "aboutUs": "At Plumbplus Company, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch service to our local community. With our extensive expertise and specialized knowledge, we offer a wide range of plumbing solutions tailored to meet your unique needs. From routine maintenance to complex installations, our team is equipped to handle any plumbing challenge with precision and efficiency.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a trusted local plumbing partner.",
    "sellingPoints": [
      "Prompt and reliable emergency services, ensuring your plumbing issues are addressed promptly and effectively.",
      "Cutting-edge techniques and state-of-the-art equipment, ensuring efficient and long-lasting solutions.",
      "Commitment to customer satisfaction, with transparent communication and competitive pricing."
    ]
  }
}