{
  "slug": "professional-plumbing-service-llc",
  "businessName": "Professional Plumbing Service LLC",
  "processedImages": 12,
  "totalTokens": 12302,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPWcD5CAneXuK3vktVKwCzlcT_66vLwY8YWT3Cu=w2048-h2048-k-no",
      "description": "This image showcases the expertise of our plumbers in installing and maintaining complex plumbing systems under residential or commercial buildings. It highlights our ability to work in confined spaces and handle intricate piping configurations.",
      "callToAction": "Trust our skilled professionals to handle your most challenging plumbing projects. Contact us today for a free consultation."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO--FBrNGjwUBIB0Q-I_xmKO0OVjHXbs0R-VYdI=w2048-h2048-k-no",
      "description": "This image demonstrates our commitment to using state-of-the-art equipment and following industry best practices. It showcases our attention to detail and dedication to providing top-notch plumbing services.",
      "callToAction": "Experience the difference of working with a professional plumbing company. Schedule your service today and enjoy peace of mind."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOz7ychQCF_5yt84Ujlv5QOv2wD67UCJ3gCI8bl=w2048-h2048-k-no",
      "description": "This image captures our team's ability to handle outdoor plumbing projects, such as installing or repairing underground pipes and drainage systems. It highlights our expertise in navigating challenging terrain and ensuring proper functionality.",
      "callToAction": "Don't let outdoor plumbing issues disrupt your property. Trust our experienced professionals to resolve them efficiently and effectively."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNLg_ugkUkufJp7Bt_BiBhFIoGj0sNkUqZwQ3tK=w2048-h2048-k-no",
      "description": "This image showcases our team's expertise in handling large-scale commercial plumbing projects. It demonstrates our ability to work in industrial settings and our commitment to meeting the highest standards of quality and safety.",
      "whyItWorks": "This image effectively conveys the company's capabilities in tackling complex plumbing challenges, instilling confidence in potential clients seeking reliable and experienced professionals."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO8FWkd6fL84hV83LMvs6GQtYhAAt99vrhSAgdK=w2048-h2048-k-no",
      "description": "This image highlights our attention to detail and commitment to quality workmanship. It showcases our team's expertise in installing and maintaining residential plumbing systems, ensuring a seamless and efficient experience for homeowners.",
      "whyItWorks": "By showcasing our residential plumbing expertise, this image resonates with homeowners seeking trustworthy and skilled professionals to handle their plumbing needs, effectively positioning the company as a reliable choice."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJJyRFa9WbjIgRh48m54XQHgk",
      "name": "Elizabeth Langston",
      "text": "Very knowledgeable and professional!!",
      "textTranslated": null,
      "publishAt": "5 months ago",
      "publishedAtDate": "2024-08-01T18:23:26.662Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURibU1MWmxnRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURibU1MWmxnRRAB!2m1!1s0x0:0x91ed085e7268f87!3m1!1s2@1:CIHM0ogKEICAgIDbmMLZlgE%7CCgwInqWvtQYQkOeCvAI%7C?hl=en",
      "reviewerId": "113171593210405019467",
      "reviewerUrl": "https://www.google.com/maps/contrib/113171593210405019467?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocJa9hCcc67Km1P8G1NFFS8wDs0w-YkpHSkuOSYOhgKXQrmTOQ=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 5,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJJyRFa9WbjIgRh48m54XQHgk",
      "location": {
        "lat": 33.2744416,
        "lng": -86.3667099
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment",
        "Gasfitter"
      ],
      "title": "Professional Plumbing Service LLC",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Professional%20Plumbing%20Service%20LLC&query_place_id=ChIJJyRFa9WbjIgRh48m54XQHgk",
      "price": null,
      "cid": "657191869169962887",
      "fid": "0x888c9bd56b452427:0x91ed085e7268f87",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipO7jcIWj94oZrTNn1YQ-ihRQKAq8SGqE7NzHOi2=w408-h306-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "2024-08-01",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 1,
  "last365": 1,
  "plumberResearchFull.json": "### Business Information:\n\n- **Alabama Business Registration/License Details**:\n  - Professional Plumbing Service LLC is registered as a Limited Liability Company (LLC) in Alabama. However, specific registration details such as the registration date and license numbers are not provided in the available sources.\n\n- **Physical Location and Service Areas**:\n  - The physical location of Professional Plumbing Service LLC is at 16005 Veterans Memorial Parkway, Lafayette, Alabama[2].\n  - The service areas include Cusseta, Five Points, Fredonia, Huguley, Lafayette, Penton, Waverly, Lee County, Tallapoosa County, and Alexander City, as well as parts of Troup County in Georgia[2].\n\n- **Hours and Payment Methods**:\n  - The specific business hours and payment methods are not detailed in the available sources.\n\n- **Years in Operation**:\n  - The exact years in operation are not specified, but the business has been active since at least the time it was listed on Houzz, which does not provide a specific start date[2].\n\n### Services & Specialties:\n\n- **Types of Services Offered**:\n  - Professional Plumbing Service LLC provides a variety of services including plumbing repair, toilet installation, faucet installation, water heater installation, tankless water heater installation, shower installation, water treatment system installation, basement remodeling, bathroom remodeling, and general contracting[2].\n\n- **Service Areas Covered**:\n  - As mentioned, the service areas include several locations in Lee County, Tallapoosa County, and surrounding areas[2].\n\n- **Emergency Service Availability**:\n  - There is no explicit mention of 24/7 emergency service availability, but the range of services suggests they may handle urgent plumbing issues.\n\n- **Prices or Rates**:\n  - No specific prices or rates are listed in the available sources.\n\n### Customer Reviews & Reputation:\n\n- **Review Summaries with Specific Examples**:\n  - There is only one review mentioned, which gives the business a 5-star rating. However, no specific details or examples from this review are provided[2].\n\n- **BBB Rating and Status**:\n  - There is no information available indicating that Professional Plumbing Service LLC is listed or rated by the Better Business Bureau (BBB).\n\n- **Common Customer Feedback Themes**:\n  - With only one review, there are no common themes or feedback patterns to report.\n\n- **Response to Reviews**:\n  - There is no information on how the business responds to reviews, given the limited number of reviews available.\n\n### Owner & Staff:\n\n- **Owner/Management Information**:\n  - The owners or management team members are not specifically named in the available sources, although it is clear that the business is operated under the entity \"Professional Plumbing Service LLC\"[2].\n\n- **Staff Qualifications**:\n  - There is no detailed information on the qualifications or certifications of the staff.\n\n- **Professional Certifications**:\n  - No specific professional certifications are mentioned for the staff or owners of Professional Plumbing Service LLC[2].",
  "aboutUs": "Professional Plumbing Service LLC is a trusted local plumbing company serving Lee County, Tallapoosa County, and surrounding areas in Alabama. Our team of skilled professionals specializes in a wide range of services, from plumbing repairs and installations to bathroom remodeling and water treatment systems. With a focus on quality workmanship and customer satisfaction, we are committed to providing exceptional service to homeowners and businesses throughout the region.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a reliable and knowledgeable plumbing partner.",
    "sellingPoints": [
      "Comprehensive expertise: Our team is well-versed in all aspects of plumbing, from routine maintenance to complex installations, ensuring your needs are met with precision and efficiency.",
      "Prompt and professional service: We understand the urgency of plumbing issues and prioritize prompt response times, arriving at your doorstep fully equipped to handle any situation with professionalism and care.",
      "Commitment to quality: We take pride in our work and use only the highest-quality materials and techniques, ensuring long-lasting solutions that meet or exceed industry standards."
    ]
  }
}