{
  "slug": "quality-plumbing-co",
  "businessName": "Quality Plumbing Co.",
  "processedImages": 5,
  "totalTokens": 6681,
  "heroSection": [
    {
      "imageIndex": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=SFmSslgOclcgXOKLCeqcLA&cb_client=maps_sv.tactile.gps&w=1600&h=1000&yaw=203.04424&pitch=0&thumbfov=100",
      "description": "An exterior view of a residential property showcasing a well-maintained lawn, trees, and a driveway leading to the main house, demonstrating the company's expertise in serving residential clients.",
      "callToAction": "Trust Quality Plumbing Co. for all your residential plumbing needs, from routine maintenance to complex installations."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPQQ8kAP5pSaMTqqNq7-ikv2dSg4GKXXOPuNZPT=w2048-h2048-k-no",
      "description": "A close-up view of two modern tankless water heaters installed in a residential setting, highlighting the company's proficiency in installing and servicing cutting-edge plumbing systems.",
      "callToAction": "Upgrade to energy-efficient tankless water heaters with Quality Plumbing Co. and enjoy endless hot water while reducing your utility bills."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO6boQZgCRFHiXBJfECl2xsYdX9YgTDwEb3eXZ-=w2048-h2048-k-no",
      "description": "The company's logo and contact information, showcasing their professional branding and commitment to quality service.",
      "callToAction": "For reliable and top-notch plumbing services in Union Grove, AL, contact Quality Plumbing Co. at 256-738-5625."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPRL0AiLbxNlh5LPs0xa2Abl357bz8Cz3ab9s9W=w2048-h2048-k-no",
      "description": "A custom-built vanity with a copper sink and wooden countertop, showcasing the company's craftsmanship and attention to detail in creating unique plumbing solutions.",
      "justification": "This image demonstrates the company's ability to handle custom projects and their commitment to delivering high-quality workmanship, making it an excellent choice for the About Us section."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPQQ8kAP5pSaMTqqNq7-ikv2dSg4GKXXOPuNZPT=w2048-h2048-k-no",
      "description": "A close-up view of two modern tankless water heaters installed in a residential setting, highlighting the company's expertise in installing and servicing advanced plumbing systems.",
      "justification": "This image showcases the company's proficiency in working with cutting-edge plumbing technologies, positioning them as knowledgeable and capable professionals in the industry."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJqUsqKDvjiYgRMzj_18zTZ10",
      "name": "Alexanne Bobo",
      "text": null,
      "textTranslated": null,
      "publishAt": "3 years ago",
      "publishedAtDate": "2021-07-14T21:06:24.377Z",
      "likesCount": 0,
      "reviewId": "ChZDSUhNMG9nS0VJQ0FnSURxN2UySFNBEAE",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURxN2UySFNBEAE!2m1!1s0x0:0x5d67d3ccd7ff3833!3m1!1s2@1:CIHM0ogKEICAgIDq7e2HSA%7CCgwI0KO9hwYQoNOatAE%7C?hl=en",
      "reviewerId": "103528402004288654479",
      "reviewerUrl": "https://www.google.com/maps/contrib/103528402004288654479?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocLo1IG_k3pmSz24Jw9lk58hDqnUx9gXEapJmwy9YtWzxdy5HA=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 2,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {
        "null": "Yes"
      },
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJqUsqKDvjiYgRMzj_18zTZ10",
      "location": {
        "lat": 34.391467,
        "lng": -86.4298714
      },
      "address": "2577 Union Grove Rd, Union Grove, AL 35175",
      "neighborhood": null,
      "street": "2577 Union Grove Rd",
      "city": "Union Grove",
      "postalCode": "35175",
      "state": "Alabama",
      "countryCode": "US",
      "categoryName": "Plumber",
      "categories": [
        "Plumber"
      ],
      "title": "Quality Plumbing Co.",
      "totalScore": 5,
      "permanentlyClosed": true,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Quality%20Plumbing%20Co.&query_place_id=ChIJqUsqKDvjiYgRMzj_18zTZ10",
      "price": null,
      "cid": "6730581044879112243",
      "fid": "0x8889e33b282a4ba9:0x5d67d3ccd7ff3833",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipPRL0AiLbxNlh5LPs0xa2Abl357bz8Cz3ab9s9W=w408-h407-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "2021-07-14",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the available sources, here is the information that could be verified for the specific Alabama plumbing business, **Quality Plumbing Co.**, located at **2577 Union Grove Rd, Union Grove, AL 35175**:\n\n## Business Information\n- **Physical Location and Service Areas**: The business is located at 2577 Union Grove Rd, Union Grove, AL 35175. However, specific service areas are not detailed in the available sources.\n- **Phone**: +1 256-738-5625[Given in the query].\n- **Years in Operation**: The exact years in operation for this specific business are not provided in the available sources.\n- **Alabama Business Registration/License Details**: This information is not available in the provided sources. For detailed registration and license information, you would need to check with the Alabama Department of Revenue or the State of Alabama Plumbers & Gas Fitters Examining Board directly[5].\n\n## Services & Specialties\n- **Types of Services Offered**: The specific types of services offered by this business are not detailed in the available sources. Typically, plumbing services include residential and commercial plumbing, repairs, installations, and maintenance, but this needs to be verified directly from the business.\n- **Service Areas Covered**: As mentioned, the service areas are not specified in the available sources.\n- **Emergency Service Availability**: There is no information available on whether this business offers emergency services.\n- **Prices or Rates**: No pricing or rate information is available for this specific business.\n\n## Customer Reviews & Reputation\n- **Review Summaries with Specific Examples**: With only 1 review and a rating of 5, there are no detailed summaries or specific examples available from the provided sources.\n- **BBB Rating and Status**: There is no BBB profile or rating available for this specific business in the provided sources.\n- **Common Customer Feedback Themes**: Given the lack of multiple reviews, common feedback themes cannot be identified.\n- **Response to Reviews**: There is no information on how the business responds to reviews.\n\n## Owner & Staff\n- **Owner/Management Information**: The owner or management details for this specific business are not provided in the available sources.\n- **Staff Qualifications**: There is no information available on the qualifications or professional certifications of the staff.\n- **Professional Certifications**: No information is available on any professional certifications held by the owner or staff.\n\nGiven the limited information available from the sources, it is recommended to contact the business directly or check with local business registries for more detailed information.",
  "aboutUs": "Quality Plumbing Co. is a trusted local plumbing service provider, specializing in residential and commercial plumbing solutions. Our team of highly skilled and certified professionals offers a comprehensive range of services, from routine maintenance and repairs to complex installations and emergency services. With a deep commitment to excellence, we prioritize delivering top-notch workmanship and exceptional customer service to every client in the Union Grove area.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with Quality Plumbing Co.'s unparalleled expertise and reliable service.",
    "sellingPoints": [
      "Highly trained and certified technicians equipped with the latest tools and techniques to handle any plumbing challenge efficiently.",
      "Prompt response times and 24/7 emergency services, ensuring your plumbing issues are addressed promptly, minimizing disruptions.",
      "Commitment to using high-quality materials and following industry best practices, ensuring long-lasting solutions and customer satisfaction."
    ]
  }
}