{
  "slug": "reliable-usa-plumbing",
  "businessName": "Reliable USA Plumbing",
  "processedImages": 5,
  "totalTokens": 10861,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOFSsk7fqPDaBfy8uS9_PXNU0nWM7YomC2tJ3tl=w2048-h2048-k-no",
      "description": "A professional truck from Reliable USA Home Services, showcasing their branding and readiness to serve customers' needs in a lush, natural setting.",
      "callToAction": "Trust the reliable experts for all your home service needs. Contact us today for a free consultation."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOstwx6arKUqkNjOLKnSqjKAANXfgxOvpW1S3rk=w2048-h2048-k-no",
      "description": "A rugged Reliable USA Home Services truck navigating a residential area, demonstrating their ability to reach customers wherever they are needed.",
      "callToAction": "Don't let home repairs stress you out. Our reliable team is just a call away. Schedule your service now."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPjwqrOCGNbkHmgmS1iwx4JDZMmbf5GxJdLzoLH=w2048-h2048-k-no",
      "description": "A Reliable USA Home Services truck parked at their facility, representing their professional fleet and commitment to quality service.",
      "callToAction": "Experience the difference of working with a truly reliable home services provider. Get a free quote now."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNrcSfPSdyZnZ3MOWTslYmoehoRbp1Nd8dZc-O8=w2048-h2048-k-no",
      "description": "An organized stockroom showcasing a range of supplies and materials, demonstrating Reliable USA's preparedness and capability to handle any home service project.",
      "reason": "This image highlights the company's resources and readiness to take on diverse projects, instilling confidence in potential customers."
    },
    {
      "imageIndex": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=6jM-FiqzSaZGnu6lECSjVA&cb_client=maps_sv.tactile.gps&w=1600&h=1000&yaw=95.79648&pitch=0&thumbfov=100",
      "description": "A serene park-like setting with mature trees and a walking path, representing the company's commitment to serving the local community.",
      "reason": "This image conveys Reliable USA's deep roots in the area and their dedication to enhancing the living environments of their neighbors."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Reliable USA Plumbing\" (ID: ChIJY7l4avMPmogRI3BVzemsHyE) has no reviews",
      "searchString": "place_id:ChIJY7l4avMPmogRI3BVzemsHyE",
      "isAdvertisement": false,
      "placeId": "ChIJY7l4avMPmogRI3BVzemsHyE",
      "location": {
        "lat": 30.4063234,
        "lng": -87.6970535
      },
      "address": "817 W Laurel Ave, Foley, AL 36535, United States",
      "neighborhood": null,
      "street": "817 W Laurel Ave",
      "city": "Foley",
      "postalCode": "36535",
      "state": "Alabama",
      "countryCode": "US",
      "categoryName": "Plumber",
      "categories": [
        "Plumber"
      ],
      "title": "Reliable USA Plumbing",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Reliable%20USA%20Plumbing&query_place_id=ChIJY7l4avMPmogRI3BVzemsHyE",
      "price": null,
      "cid": "2386816447701938211",
      "fid": "0x889a0ff36a78b963:0x211face9cd557023",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOFSsk7fqPDaBfy8uS9_PXNU0nWM7YomC2tJ3tl=w408-h326-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for the specific Alabama plumbing business, Reliable USA Plumbing, located at 817 W Laurel Ave, Foley, AL 36535:\n\n## Business Information\n- **Alabama business registration/license details**: There is no specific information available in the provided sources regarding the Alabama business registration or license details for Reliable USA Plumbing.\n- **Physical location and service areas**: The business is located at 817 W Laurel Ave, Foley, AL 36535. However, the exact service areas are not specified in the provided sources.\n- **Hours and payment methods**: There is no detailed information available on the hours of operation or payment methods for Reliable USA Plumbing.\n- **Years in operation**: The sources do not provide information on how long Reliable USA Plumbing has been in operation.\n\n## Services & Specialties\n- **Types of services offered**: While the specific services offered by Reliable USA Plumbing are not detailed in the provided sources, typical plumbing services include drain cleaning, faucet repairs, water heater installations, and other plumbing-related tasks, as seen in similar businesses[1][4].\n- **Service areas covered**: As mentioned, the business is based in Foley, AL, but the exact service areas are not specified.\n- **Emergency service availability**: There is no information available indicating whether Reliable USA Plumbing offers emergency services.\n- **Any listed prices or rates**: No pricing or rate information is available for Reliable USA Plumbing in the provided sources.\n\n## Customer Reviews & Reputation\n- **Review summaries with specific examples**: There are no customer reviews or ratings available in the provided sources specifically for Reliable USA Plumbing at the given address.\n- **BBB rating and status**: The Better Business Bureau (BBB) listings provided do not include Reliable USA Plumbing at the specified address in Foley, AL[2][5].\n- **Common customer feedback themes**: Without specific reviews, it is not possible to identify common customer feedback themes.\n- **Response to reviews**: There is no information on how the business responds to customer reviews.\n\n## Owner & Staff\n- **Owner/management information**: The owner or management details for Reliable USA Plumbing are not provided in the sources.\n- **Staff qualifications**: There is no information available regarding the qualifications or professional certifications of the staff at Reliable USA Plumbing.\n- **Professional certifications**: No specific certifications or professional credentials are mentioned for the staff of Reliable USA Plumbing.\n\nGiven the lack of specific information in the provided sources, it appears that detailed data on Reliable USA Plumbing at 817 W Laurel Ave, Foley, AL 36535, is not readily available. To obtain more accurate and comprehensive information, additional sources such as the business's official website, local business directories, or direct contact with the business may be necessary.",
  "aboutUs": "Reliable USA Plumbing is a trusted local plumbing company serving Foley, Alabama, and the surrounding areas. Our team of highly skilled and certified professionals specializes in a wide range of plumbing services, from routine maintenance and repairs to complex installations and emergency services. We take pride in our expertise, attention to detail, and commitment to providing top-notch solutions tailored to your unique needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a reliable and knowledgeable plumbing partner.",
    "sellingPoints": [
      "Prompt and efficient service, with a focus on minimizing disruptions to your daily routine.",
      "Comprehensive solutions backed by extensive training and the latest industry techniques.",
      "Transparent pricing and a commitment to clear communication throughout the entire process."
    ]
  }
}