{
  "slug": "rescue-me-plumbing-llc",
  "businessName": "Rescue Me Plumbing, LLC",
  "processedImages": 12,
  "totalTokens": 25236,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO7sXjxkzQJDB9vg04ib7wwNxmuCyRwUEpuCUlM=w2048-h2048-k-no",
      "description": "This image showcases the intricate plumbing work involved in a new construction project. It displays the complex network of pipes and fixtures that are carefully installed to ensure proper water flow and drainage.",
      "callToAction": "Trust our experienced team to handle all your new construction plumbing needs with precision and expertise."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNfSwhcXkfiEWYrpBoO-T9hZjaidSVT1bxEG9hz=w2048-h2048-k-no",
      "description": "This image captures the company's service vehicle and equipment, demonstrating their readiness to tackle any plumbing job, no matter the location or complexity.",
      "callToAction": "Don't let plumbing issues disrupt your daily routine. Call us for prompt and reliable service."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipO6QZF1IgYTGuPscEttWiXucorw7g6zlGgXTffL=w2048-h2048-k-no",
      "description": "This image highlights the company's attention to detail and commitment to quality workmanship, showcasing a beautifully installed sink and countertop.",
      "callToAction": "Upgrade your kitchen or bathroom with our top-notch plumbing and installation services."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNwX1NJvrME-K9dUAKlAD9msAIZPSorCKZ8LyY9=w2048-h2048-k-no",
      "description": "This image showcases the company's expertise in water heater installation and maintenance, a crucial aspect of any plumbing system.",
      "relevance": "It demonstrates the company's capability to handle complex plumbing tasks, ensuring reliable hot water supply for their customers."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNI01B1UjY_OiHbygeahVWGDe5YaA79xiC8JAuB=w2048-h2048-k-no",
      "description": "This image provides a behind-the-scenes look at the company's commitment to using high-quality materials and following industry best practices.",
      "relevance": "It highlights the company's dedication to delivering top-notch plumbing solutions, ensuring customer satisfaction and long-lasting results."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJmxZ-6cCbjogRlWPxBqa3iNw",
      "name": "B DUB",
      "text": "I spoke with David, the owner, and  and after seeing some pictures of the water heater to be replaced he told me they could do it the next day which was Sunday. I chose Monday, as I was coming from out of town. He told me he would be late afternoon  and then updated me when his guy was running  a little late. When Jason, his assistant arrived he jumped right on it and all about business. I will definitely use them for all my plumbing in Montgomery AL.",
      "textTranslated": null,
      "publishAt": "4 years ago",
      "publishedAtDate": "2020-07-14T11:59:07.212Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUM4aTRLZmdRRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM4aTRLZmdRRRAB!2m1!1s0x0:0xdc88b7a606f16395!3m1!1s2@1:CIHM0ogKEICAgIC8i4KfgQE%7CCgsIi7y2-AUQ8OG3ZQ%7C?hl=en",
      "reviewerId": "111555939075769061007",
      "reviewerUrl": "https://www.google.com/maps/contrib/111555939075769061007?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocKBhUpEy6dyZX-Zj3m42X6M06ISZ02bBHIiZIEnzKjFiiJ_9Q=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 11,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJmxZ-6cCbjogRlWPxBqa3iNw",
      "location": {
        "lat": 32.431586,
        "lng": -86.312289
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Rescue Me Plumbing, LLC",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Rescue%20Me%20Plumbing%2C%20LLC&query_place_id=ChIJmxZ-6cCbjogRlWPxBqa3iNw",
      "price": null,
      "cid": "15891153208885732245",
      "fid": "0x888e9bc0e97e169b:0xdc88b7a606f16395",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipNC8Fg0RRZYglCMHVhjO1qoPkykneBNrxd5LCL5=w408-h306-k-no"
    }
  ],
  "ownerName": "David",
  "ownerConfidence": 40,
  "servicesMentioned": [
    "water heater"
  ],
  "firstReviewDate": "2020-07-14",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Here is the detailed information about Rescue Me Plumbing, LLC in Alabama, based on the provided identifiers:\n\n## Business Information:\n- **Alabama Business Registration/License Details**: Rescue Me Plumbing, LLC is a Limited Liability Company (LLC) incorporated on October 25, 2017[1].\n- **Physical Location and Service Areas**: The business is located at 113 Grand Park Dr, Deatsville, AL 36022-2842. However, specific service areas are not detailed in the available sources, but it is implied to serve the central and south Alabama region given its affiliation with the BBB Serving Central & South Alabama[1].\n- **Hours and Payment Methods**: There is no explicit information on the business hours, but it is mentioned that the business was started in 2017. Payment methods are not specified in the available sources.\n- **Years in Operation**: As of the current date, Rescue Me Plumbing, LLC has been in operation for approximately 7 years, having started on October 25, 2017[1].\n\n## Services & Specialties:\n- **Types of Services Offered**: While the specific services are not detailed in the provided sources, it is generally understood that plumbing businesses offer services such as plumbing repairs, installations, and possibly sewer and drain services. However, for precise services, more detailed sources would be necessary.\n- **Service Areas Covered**: As mentioned, the service area is likely within central and south Alabama, but exact boundaries are not specified.\n- **Emergency Service Availability**: There is no explicit mention of 24/7 emergency service availability for this specific business in the provided sources.\n- **Any Listed Prices or Rates**: No prices or rates are listed in the available sources[1].\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: There is only one review mentioned, which gives the business a 5-star rating, but no specific examples or details are provided[1].\n- **BBB Rating and Status**: Rescue Me Plumbing, LLC is not a BBB Accredited Business but has an A+ BBB rating. To become accredited, the business must agree to BBB Standards for Trust and pass BBB's vetting process[1].\n- **Common Customer Feedback Themes**: With only one review, there are no common feedback themes to report.\n- **Response to Reviews**: There is no information available on how the business responds to reviews.\n\n## Owner & Staff:\n- **Owner/Management Information**: The owner of Rescue Me Plumbing, LLC is Mr. David Terry[1].\n- **Staff Qualifications**: There is no information available on the qualifications of the staff.\n- **Professional Certifications**: No specific professional certifications are mentioned for the owner or staff of this business[1].\n\nIn summary, Rescue Me Plumbing, LLC is a 7-year-old plumbing business based in Deatsville, Alabama, owned by Mr. David Terry, with an A+ BBB rating but not BBB accredited. Detailed services and customer feedback are limited in the available sources.",
  "aboutUs": "Rescue Me Plumbing, LLC is a trusted local plumbing company serving central and south Alabama with expertise in residential and commercial plumbing services. Our team of highly skilled and certified professionals specializes in plumbing repairs, installations, and maintenance, ensuring your systems operate efficiently and reliably. We take pride in our commitment to quality workmanship and exceptional customer service.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a reliable and knowledgeable plumbing partner.",
    "sellingPoints": [
      "Rapid response times for all plumbing emergencies, minimizing downtime and potential damage.",
      "Comprehensive solutions tailored to your specific plumbing needs, backed by our team's extensive expertise.",
      "Transparent pricing and upfront cost estimates, ensuring no surprises and complete customer satisfaction."
    ]
  }
}