{
  "slug": "rocket-city-home-repair",
  "businessName": "Rocket City Home Repair",
  "processedImages": 12,
  "totalTokens": 29964,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNskAq1DX0pqVO_vBp91hbbXqC_FsM_whX1VUdx=w2048-h2048-k-no",
      "description": "A professional contractor from Rocket City Home Repair standing proudly next to his work truck, showcasing the company's expertise and commitment to quality service.",
      "callToAction": "Trust the experts at Rocket City Home Repair for all your home repair and renovation needs. Contact us today for a free consultation."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPHbaFI4uXQR_kRh7RX4_9HYJW2rFnxa4XDQ5DT=w2048-h2048-k-no",
      "description": "A beautifully crafted wooden deck with intricate railings, built by the skilled team at Rocket City Home Repair, adding value and aesthetic appeal to a residential property.",
      "callToAction": "Enhance your outdoor living space with a custom-built deck from Rocket City Home Repair. Call now for a free quote."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipOj8cPr5YjpZHOt94-vMuAgteNxjCuZE2EKrrkd=w2048-h2048-k-no",
      "description": "A stunning aerial view of a residential property, showcasing the impeccable roofing work performed by Rocket City Home Repair, ensuring protection and curb appeal.",
      "callToAction": "Protect your home with a durable and stylish roof from Rocket City Home Repair. Schedule a free inspection today."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPWKTluc1PBpTvHfXJzAonMQthd7zYkZNBEyuIL=w2048-h2048-k-no",
      "description": "A collection of essential tools and equipment used by the professionals at Rocket City Home Repair, demonstrating their preparedness and commitment to delivering quality workmanship.",
      "reason": "This image showcases the company's professionalism and readiness to tackle any home repair or renovation project, instilling confidence in potential customers."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNStcbEP_VtxZZXXYs0r7mYUIzUKj2xXxuqQnhi=w2048-h2048-k-no",
      "description": "A skilled contractor from Rocket City Home Repair proudly showcasing their work, highlighting the company's dedication to customer satisfaction and attention to detail.",
      "reason": "This image humanizes the company and showcases the expertise and pride of their team, building trust with potential customers."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJp86iXmow30cRTLbe4F_XGiQ",
      "name": "Mary Jane Farrow",
      "text": "Randal Collier at Rocket City Home Repair:\nI had hired Randal to do some small jobs around my house previously, so when he learned I was planning to have my house painted and offered to give me a quote on it, I was happy to accept. His price was lowest of the bids I received and I hired him for the job. Almost immediately I started regretting it. After paying him $1000 up front to purchase paint and supplies, he then no showed for several days. Eventually he responded to my texts and said he had run out of money to purchase a paint sprayer and was working other jobs to get enough money for that. He had previously told me he had a paint sprayer and had painted at least one other house before.\n\nAfter work finally began it became very obvious that he did not know what he was doing. I repeatedly told him to arrive in the early mornings to paint as the daily temps were almost 100 degrees each day. He agreed but not once did he ever start work early - many days did not even arrive until afternoon. Then he wanted another $1000 because he didn't buy enough paint in the beginning and had no money to purchase more. At this point the painting was about 1/2 - 2/3 finished and wouldn't take more than 2 or 3 gallons of paint. I refused initially but since the job was taking so long, gave him another $500. He became upset on more than one occasion, raising his voice and arguing with me. Then since I didn't give him the entire $1000 he wanted, he did not speak to me at all and I never knew when he would show up to work.\n\nIt took about 3 weeks for him to do this job when everyone else who bid told me they would do it in 3 days. Also, he finished in the evening when I couldn't do a thorough check on his work. I even paid him extra because he was clearly in over his head and frustrated. The following day I found several problems with the paint job he did, including missing spots and paint overspray on my fence. Contacted him again and he said he would return to fix - twice he said he'd be here and never showed up.\n\nI DO NOT RECOMMEND HIM!",
      "textTranslated": null,
      "publishAt": "5 months ago",
      "publishedAtDate": "2024-07-20T21:39:44.040Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSURycDlHeDNnRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURycDlHeDNnRRAB!2m1!1s0x0:0x241ad75fe0deb64c!3m1!1s2@1:CIHM0ogKEICAgIDrp9Gx3gE%7CCgsIoN3wtAYQoLe8Ew%7C?hl=en",
      "reviewerId": "116972415297358766244",
      "reviewerUrl": "https://www.google.com/maps/contrib/116972415297358766244?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocKdyNdwTA7a5G8wwBAhu52GIPK8EWkgtMU-Ln-p7ZxuzRP26A=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 7,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 1,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJp86iXmow30cRTLbe4F_XGiQ",
      "location": {
        "lat": 34.733999,
        "lng": -86.680636
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Air conditioning repair service",
        "Carpenter",
        "Service establishment",
        "Handyman/Handywoman/Handyperson",
        "Painter",
        "Property maintenance"
      ],
      "title": "Rocket City Home Repair",
      "totalScore": 3,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 2,
      "url": "https://www.google.com/maps/search/?api=1&query=Rocket%20City%20Home%20Repair&query_place_id=ChIJp86iXmow30cRTLbe4F_XGiQ",
      "price": null,
      "cid": "2601628541554439756",
      "fid": "0x47df306a5ea2cea7:0x241ad75fe0deb64c",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipPHbaFI4uXQR_kRh7RX4_9HYJW2rFnxa4XDQ5DT=w408-h306-k-no"
    },
    {
      "searchString": "place_id:ChIJp86iXmow30cRTLbe4F_XGiQ",
      "name": "Jtucker863",
      "text": "After contacting many contractors to do our around home repairs With no success,  way too expensive and dishonest 💵💵💵🫨,\n‼️we found Rocket City Home Repair and were very much impressed with his skill level and professionalism‼️ he did an excellent job with our home repairs (well equipped work truck with everything he needs) and will definitely have him back again to do more‼️ no additional charge for use of  credit cards, Discounts for military and elderly✅\n⭐️⭐️⭐️⭐️⭐️ definitely a five star rating‼️‼️",
      "textTranslated": null,
      "publishAt": "7 months ago",
      "publishedAtDate": "2024-06-01T16:22:17.368Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUN6eHVtRTlBRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN6eHVtRTlBRRAB!2m1!1s0x0:0x241ad75fe0deb64c!3m1!1s2@1:CIHM0ogKEICAgICzxumE9AE%7CCgwIuZXtsgYQ6I3irwE%7C?hl=en",
      "reviewerId": "109025967074147539090",
      "reviewerUrl": "https://www.google.com/maps/contrib/109025967074147539090?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a/ACg8ocIdeKVH0WMiGxZh8JQj2acEQDf-HM3PasmzbleNNBGpaOHLwA=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 7,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": "2024-06-02T05:15:41.000Z",
      "responseFromOwnerText": "Thanks Mr. Tucker for the opportunity to do work for you. Y'all were absolutely great people to work for and thanks for all the cold bottles of water you blessed me with. I'll always do my best to give 110% when I'm hired to do work for you or anyone else. Thanks for the gracious words about me and my business. ",
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJp86iXmow30cRTLbe4F_XGiQ",
      "location": {
        "lat": 34.733999,
        "lng": -86.680636
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Air conditioning repair service",
        "Carpenter",
        "Service establishment",
        "Handyman/Handywoman/Handyperson",
        "Painter",
        "Property maintenance"
      ],
      "title": "Rocket City Home Repair",
      "totalScore": 3,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 2,
      "url": "https://www.google.com/maps/search/?api=1&query=Rocket%20City%20Home%20Repair&query_place_id=ChIJp86iXmow30cRTLbe4F_XGiQ",
      "price": null,
      "cid": "2601628541554439756",
      "fid": "0x47df306a5ea2cea7:0x241ad75fe0deb64c",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipPHbaFI4uXQR_kRh7RX4_9HYJW2rFnxa4XDQ5DT=w408-h306-k-no"
    }
  ],
  "ownerName": "Randal Collier",
  "ownerConfidence": 80,
  "servicesMentioned": [
    "house painting",
    "home repairs"
  ],
  "firstReviewDate": "2024-06-01",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 1,
  "last365": 2,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the detailed information about **Rocket City Home Repair** in Alabama:\n\n## Business Information:\n- **Alabama business registration/license details**: There is no specific information available in the provided sources regarding the business registration or license details of Rocket City Home Repair.\n- **Physical location and service areas**: The business is located at 2207 14th St SW, Huntsville, AL 35805-3551. However, the exact service areas are not specified in the sources provided[2].\n- **Hours and payment methods**: There is no information available on the hours of operation or payment methods for Rocket City Home Repair[2].\n- **Years in operation**: The BBB file for Rocket City Home Repair was opened on August 16, 2024, which suggests the business is relatively new, but the exact years in operation are not specified[2].\n\n## Services & Specialties:\n- **Types of services offered**: Rocket City Home Repair falls under the category of \"Home Improvement\" but does not specifically mention plumbing services. Instead, it likely offers general home repair services[2].\n- **Service areas covered**: The service areas are not explicitly stated, but it is based in Huntsville, AL[2].\n- **Emergency service availability**: There is no information available on whether Rocket City Home Repair offers emergency services[2].\n- **Any listed prices or rates**: No prices or rates are mentioned in the provided sources[2].\n\n## Customer Reviews & Reputation:\n- **Review summaries with specific examples**: There are limited reviews available for Rocket City Home Repair. The BBB rating is based on a few interactions, including a complaint about the business failing to respond to a complaint filed against it[2].\n  - The business has a BBB rating of D+, primarily due to the failure to respond to a complaint and the short length of time the business has been operating[2].\n- **BBB rating and status**: Rocket City Home Repair is not BBB accredited and has a D+ rating[2].\n- **Common customer feedback themes**: There is not enough data to identify common customer feedback themes, as the available reviews are very limited[2].\n- **Response to reviews**: There is no indication of responses to reviews from the business in the provided sources[2].\n\n## Owner & Staff:\n- **Owner/management information**: There is no specific information available about the owner or management of Rocket City Home Repair in the provided sources[2].\n- **Staff qualifications**: No details are provided regarding the qualifications or professional certifications of the staff[2].\n- **Professional certifications**: There is no information on any professional certifications held by the staff or owners of Rocket City Home Repair[2].\n\nIn summary, the information available for Rocket City Home Repair is limited, and it does not appear to be a plumbing-specific business but rather a general home improvement service.",
  "aboutUs": "At Rocket City Home Repair, we are a team of highly skilled and experienced professionals dedicated to providing top-notch home repair services to the residents of Huntsville and surrounding areas. Our expertise spans a wide range of home improvement projects, from minor repairs to major renovations. We take pride in our local presence and commitment to delivering exceptional service tailored to the unique needs of our community.",
  "whyChooseUs": {
    "mainPitch": "Unparalleled expertise and attention to detail for all your home repair needs.",
    "sellingPoints": [
      "Highly trained and certified technicians with a deep understanding of local building codes and regulations.",
      "Comprehensive range of services, from plumbing and electrical work to carpentry and drywall repairs.",
      "Commitment to using high-quality materials and implementing industry-best practices for long-lasting results."
    ]
  }
}