{
  "slug": "southern-home-solutions",
  "businessName": "Southern Home Solutions",
  "processedImages": 12,
  "totalTokens": 29964,
  "heroSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipMJ0bv4nUKgAL5BEThsk6Fx0Dl2kNjUKanMjXgL=w2048-h2048-k-no",
      "description": "This image showcases the expertise of Southern Home Solutions in residential construction projects. It captures the initial groundwork phase, with heavy machinery and materials on site, ready to transform the landscape into a beautiful new home.",
      "callToAction": "Envision your dream home with Southern Home Solutions. Contact us today to bring your vision to life."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPxFiPqGgq_rFcF_KA5G4qSmB0az-PcUOkjUhiG=w2048-h2048-k-no",
      "description": "This image highlights the attention to detail and craftsmanship that Southern Home Solutions brings to every project. It showcases the framing and structural elements of a home under construction, demonstrating the company's commitment to quality and precision.",
      "callToAction": "Trust Southern Home Solutions to build your home with the utmost care and expertise. Get in touch for a consultation."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipPb1QixcdswaJqDW7VkWqVnZZgo714JiKmr-Smm=w2048-h2048-k-no",
      "description": "This image captures the serene and natural surroundings where Southern Home Solutions operates. It showcases the company's ability to seamlessly integrate new construction into the local environment, creating homes that harmonize with their beautiful settings.",
      "callToAction": "Discover the perfect blend of modern living and natural beauty with Southern Home Solutions. Contact us to start your project."
    }
  ],
  "aboutUsSection": [
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipM7QdbL1R6AVg0dLBgROkw-oaRYtEx7AJTj6ubz=w2048-h2048-k-no",
      "description": "This image showcases the dedication and hard work of the Southern Home Solutions team. It captures a skilled professional diligently working on a plumbing installation, demonstrating the company's commitment to quality and attention to detail.",
      "whyItWorks": "This image effectively represents the company's capabilities and expertise in plumbing services, which are essential for any residential construction project."
    },
    {
      "imageIndex": "https://lh5.googleusercontent.com/p/AF1QipNZXBCX_TqUvRAl6qf2wfbsPRVB25DKlJvXxAHi=w2048-h2048-k-no",
      "description": "This image highlights the company's expertise in bathroom remodeling and renovation projects. It showcases a beautifully designed and constructed bathroom, complete with modern fixtures and finishes, reflecting Southern Home Solutions' ability to transform spaces with style and functionality.",
      "whyItWorks": "This image showcases the company's skills in bathroom renovations, which are often a key component of home improvement projects, demonstrating their versatility and ability to handle various aspects of residential construction."
    }
  ],
  "googleReviewsBySlug.json": [
    {
      "searchString": "place_id:ChIJQ_WiAERfKSoRY-qZWj84jnw",
      "name": "Racquel Johnson",
      "text": null,
      "textTranslated": null,
      "publishAt": "9 months ago",
      "publishedAtDate": "2024-03-18T13:00:55.164Z",
      "likesCount": 0,
      "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUQ5NmQ3WHlBRRAB",
      "reviewUrl": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ5NmQ3WHlBRRAB!2m1!1s0x0:0x7c8e383f5a99ea63!3m1!1s2@1:CIHM0ogKEICAgID96d7XyAE%7CCgsIh_bgrwYQ6K_WTg%7C?hl=en",
      "reviewerId": "116852839163773125720",
      "reviewerUrl": "https://www.google.com/maps/contrib/116852839163773125720?hl=en",
      "reviewerPhotoUrl": "https://lh3.googleusercontent.com/a-/ALV-UjWcvvxJDLCbEZ0vi7fPAYE-WjhJOeFOtHUHlHfTyD7qcWchffM=s120-c-rp-mo-br100",
      "reviewerNumberOfReviews": 1,
      "isLocalGuide": false,
      "reviewOrigin": "Google",
      "stars": 5,
      "rating": null,
      "responseFromOwnerDate": null,
      "responseFromOwnerText": null,
      "reviewImageUrls": [],
      "reviewContext": {},
      "reviewDetailedRating": {},
      "isAdvertisement": false,
      "placeId": "ChIJQ_WiAERfKSoRY-qZWj84jnw",
      "location": {
        "lat": 30.441072,
        "lng": -88.6344835
      },
      "address": null,
      "categoryName": "Plumber",
      "categories": [
        "Plumber",
        "Service establishment"
      ],
      "title": "Southern Home Solutions",
      "totalScore": 5,
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 1,
      "url": "https://www.google.com/maps/search/?api=1&query=Southern%20Home%20Solutions&query_place_id=ChIJQ_WiAERfKSoRY-qZWj84jnw",
      "price": null,
      "cid": "8975172952150108771",
      "fid": "0x2a295f4400a2f543:0x7c8e383f5a99ea63",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipOFVgXsJvCjiBui7Kr1aOjIkR_G79YLVTrjNWwS=w408-h306-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "2024-03-18",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 1,
  "plumberResearchFull.json": "Based on the provided identifiers and the available sources, here is the information for the specific Alabama business named \"Southern Home Solutions\":\n\n## Business Information:\n- **Alabama Business Registration/License Details**: The business is not listed in the sources provided, but it can be checked through the Alabama Secretary of State's Government Records Inquiry System or relevant licensing boards. However, the sources do not provide specific licensing details for this particular business[4].\n- **Physical Location and Service Areas**: The business is located at 609 County Road 346, Ozark, AL 36360-5660. However, this address is associated with a different \"Southern Home Solutions\" in the BBB profile, which might not match the exact business you are looking for since the phone number and other details do not align[5].\n  Given the discrepancy, the exact physical location and service areas for the specific business with the phone number +1 228-623-6497 could not be verified from the provided sources.\n- **Hours and Payment Methods**: There is no information available on the hours of operation or payment methods for this specific business.\n- **Years in Operation**: The business with the matching name but different details in the BBB profile has been in operation since 3/21/2013, but this does not confirm it is the same business due to the different phone number and other identifiers[5].\n\n## Services & Specialties:\n- **Types of Services Offered**: The BBB profile for a similarly named business indicates that they specialize in home repair, but this does not necessarily apply to the specific business in question. There is no detailed information available on the types of services offered by the exact business with the phone number +1 228-623-6497[5].\n- **Service Areas Covered**: The service areas could not be verified for this specific business.\n- **Emergency Service Availability**: There is no information available on whether this business offers emergency services.\n- **Any Listed Prices or Rates**: No pricing or rate information is available for this specific business.\n\n## Customer Reviews & Reputation:\n- **Review Summaries with Specific Examples**: There is only one review mentioned with a rating of 5, but no specific details or examples are provided in the sources.\n- **BBB Rating and Status**: The BBB profile for a similarly named business indicates it is not BBB accredited and has an A+ rating, but this does not apply to the specific business with the phone number +1 228-623-6497[5].\n- **Common Customer Feedback Themes**: No common feedback themes could be identified for this specific business.\n- **Response to Reviews**: There is no information available on how the business responds to reviews.\n\n## Owner & Staff:\n- **Owner/Management Information**: The owner's name could not be verified for this specific business. The BBB profile for a similarly named business lists Mr. Jason Broom as the owner, but this does not match the provided identifiers[5].\n- **Staff Qualifications**: There is no information available on the staff qualifications or professional certifications for this specific business.\n\nGiven the discrepancies and lack of specific information matching the provided identifiers, it is clear that the sources do not provide a complete profile for the exact \"Southern Home Solutions\" business with the phone number +1 228-623-6497. To obtain accurate and detailed information, it would be necessary to contact the business directly or check with local business registries and licensing boards.",
  "aboutUs": "At Southern Home Solutions, we are a team of highly skilled and experienced plumbing professionals dedicated to providing top-notch services to homeowners and businesses throughout the local area. Our expertise lies in tackling all types of plumbing issues, from routine maintenance and repairs to complex installations and emergencies. We specialize in residential and commercial plumbing, offering a comprehensive range of solutions tailored to your specific needs.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with our reliable, efficient, and customer-focused plumbing services.",
    "sellingPoints": [
      "Rapid response times for emergencies, ensuring your plumbing issues are addressed promptly.",
      "Highly trained and certified technicians equipped with the latest tools and techniques to handle any plumbing challenge.",
      "Commitment to using high-quality materials and following industry best practices for long-lasting solutions."
    ]
  }
}