{
  "slug": "yarbrough-s-general-contractors",
  "googleReviewsBySlug.json": [
    {
      "error": "no_reviews",
      "errorDescription": "Place \"Yarbrough's General Contractors\" (ID: ChIJfy_Y4a9JiIgRBQ57b4xW_CE) has no reviews",
      "searchString": "place_id:ChIJfy_Y4a9JiIgRBQ57b4xW_CE",
      "isAdvertisement": false,
      "placeId": "ChIJfy_Y4a9JiIgRBQ57b4xW_CE",
      "location": {
        "lat": 34.1428876,
        "lng": -86.752288
      },
      "address": null,
      "categoryName": "Contractor",
      "categories": [
        "Contractor",
        "Electrician",
        "Service establishment",
        "Plumber"
      ],
      "title": "Yarbrough's General Contractors",
      "permanentlyClosed": false,
      "temporarilyClosed": false,
      "reviewsCount": 0,
      "url": "https://www.google.com/maps/search/?api=1&query=Yarbrough's%20General%20Contractors&query_place_id=ChIJfy_Y4a9JiIgRBQ57b4xW_CE",
      "price": null,
      "cid": "2448927458548452869",
      "fid": "0x888849afe1d82f7f:0x21fc568c6f7b0e05",
      "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipO-LmzZadMb0xUuuwt7RTwilkdoVhr4wgIK-Zuk=w408-h450-k-no"
    }
  ],
  "ownerName": "Unknown",
  "ownerConfidence": 0,
  "servicesMentioned": [],
  "firstReviewDate": "N/A",
  "last30": 0,
  "last60": 0,
  "last90": 0,
  "last180": 0,
  "last365": 0,
  "plumberResearchFull.json": "Based on the provided identifiers and the search results, here is the information available for **Yarbrough's General Contractors** in Alabama:\n\n## Business Information\n- **Alabama Business Registration/License Details**: There is no specific information available in the provided sources regarding the business registration or license details of Yarbrough's General Contractors. For detailed registration and license information, you would need to check the Alabama Secretary of State's Government Records Inquiry System or contact the relevant licensing authorities directly[4][5].\n- **Physical Location and Service Areas**: The business is located in northern Alabama, but the exact physical address is not provided in the sources. However, it is mentioned that Yarbrough Contracting (which might be related or the same entity) serves northern Alabama[2].\n- **Hours and Payment Methods**: The hours of operation for Yarbrough Contracting (assuming it is related) are listed as 08:00 am – 05:00 pm, but payment methods are not specified[2].\n- **Years in Operation**: There is no specific information on how long Yarbrough's General Contractors has been in operation. However, Yarbrough Contracting, which might be the same or a related entity, has been serving northern Alabama since 2021[2].\n\n## Services & Specialties\n- **Types of Services Offered**: The sources do not provide detailed services offered by Yarbrough's General Contractors specifically. However, Yarbrough Contracting is described as a full-service dump truck company, which does not directly indicate plumbing services[2].\n- **Service Areas Covered**: The service area is northern Alabama[2].\n- **Emergency Service Availability**: There is no information available on whether Yarbrough's General Contractors offers emergency services.\n- **Prices or Rates**: No pricing or rate information is available for Yarbrough's General Contractors.\n\n## Customer Reviews & Reputation\n- **Review Summaries with Specific Examples**: There are no reviews available in the provided sources that specifically mention Yarbrough's General Contractors. The reviews found are for a different entity named Scott Yarbrough, Inc., which is based in Texas and not related to the Alabama business[3].\n- **BBB Rating and Status**: There is no information available on the BBB rating or status for Yarbrough's General Contractors.\n- **Common Customer Feedback Themes**: Since there are no reviews available for this specific business, there are no common customer feedback themes to report.\n- **Response to Reviews**: There is no information on how the business responds to reviews.\n\n## Owner & Staff\n- **Owner/Management Information**: The owner or management details for Yarbrough's General Contractors are not provided in the sources. However, Yarbrough Contracting is mentioned, but without specific owner details[2].\n- **Staff Qualifications**: There is no information available on the qualifications of the staff at Yarbrough's General Contractors.\n- **Professional Certifications**: No information is available on any professional certifications held by the staff or owners of Yarbrough's General Contractors.\n\nGiven the lack of specific information in the sources, it appears that Yarbrough's General Contractors may not be well-documented online, or it might be confused with another similarly named business. For more accurate and detailed information, contacting the business directly or checking with local business registries would be necessary.",
  "aboutUs": "At Yarbrough's General Contractors, we are a team of highly skilled and experienced professionals dedicated to providing top-notch plumbing services to the residents of northern Alabama. With our extensive knowledge and expertise, we specialize in a wide range of plumbing solutions, from routine maintenance to complex installations and repairs. Our commitment to excellence and customer satisfaction is unparalleled, and we take pride in our local presence and personalized approach to every project.",
  "whyChooseUs": {
    "mainPitch": "Experience the peace of mind that comes with choosing a trusted and reliable plumbing contractor.",
    "sellingPoints": [
      "Highly trained and certified technicians with a deep understanding of the latest plumbing techniques and technologies.",
      "Prompt and efficient service, ensuring that your plumbing issues are resolved quickly and effectively.",
      "Commitment to using high-quality materials and equipment, ensuring long-lasting and durable solutions."
    ]
  }
}